[
    {
        "recipe_name": "American pancakes",
        "recipe_image_link": "https://media.delight.video/0c18e53b610964fac175fe0e757adc30557e79b7/ddb3c0dcd563ef31e2e31f73019b5bb10b97a877/POSTER_USER/v1/6c93ccfb-3786-40d3-b65c-27d6c17ca3e1.jpg?quality=90",
        "recipe_ingredients": [
            "200gself-raising flour",
            "1 ½ tspbaking powder",
            "1 tbspgolden caster sugar",
            "3large eggs",
            "25gmelted butterplus extra for cooking",
            "200mlmilk",
            "vegetable oilfor cooking"
        ],
        "recipe_steps": [
            "step 1: Mix 200g self-raising flour, 1 ½ tsp baking powder, 1 tbsp golden caster sugar and a pinch of salt together in a large bowl.",
            "step 2: Create a well in the centre with the back of your spoon then add 3 large eggs, 25g melted butter and 200ml milk.",
            "step 3: Whisk together either with a balloon whisk or electric hand beaters until smooth then pour into a jug.",
            "step 4: Heat a small knob of butter and 1 tsp of oil in a large, non-stick frying pan over a medium heat. When the butter looks frothy, pour in rounds of the batter, approximately 8cm wide. Make sure you don’t put the pancakes too close together as they will spread during cooking. Cook the pancakes on one side for about 1-2 mins or until lots of tiny bubbles start to appear and pop on the surface. Flip the pancakes over and cook for a further minute on the other side. Repeat until all the batter is used up.",
            "step 5: Serve your pancakes stacked up on a plate with a drizzle of maple syrup and any of your favourite toppings."
        ],
        "nutrition_data": {}
    },
    {
        "recipe_name": "The breakfast club",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/04/BreakfastClubSandwich-2f85617.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "3 tbspsunflower oil",
            "4frozen hash browns",
            "3pork sausages",
            "4 rasherssmoked back bacon",
            "15gbutterplus extra for spreading",
            "100gchestnut mushroomssliced",
            "2eggs",
            "400g canbaked beans",
            "6 sliceswhite bread",
            "butterketchup and brown sauce, to serve"
        ],
        "recipe_steps": [
            "step 1: Heat the oven to 220C/200C fan/gas 7. Rub 1 tbsp of the oil over a large, shallow roasting tin. Put the hash browns on one half of the tin and line the sausages up on the other. Cook for 15 mins, then flip the hash browns, turn the sausages and return to the oven for 10-15 mins until the hash browns are golden, and the sausages browned. Push everything together to make room in the tin, then lay the bacon rashers in the space and return to the oven for 10-15 mins or until the bacon fat is crisp and sizzling.",
            "step 2: About 10 mins before the bacon is ready, heat 1 tbsp of oil with the butter in a frying pan until sizzling. Scatter in the mushrooms and season with salt and pepper. Fry over a high heat, tossing occasionally until softened and any liquid released has evaporated (about 5-10 mins), then tip onto a warm plate. Wipe out the pan, heat the rest of the oil and fry the eggs however you like them. While everything is cooking heat the baked beans in a saucepan or in the microwave and lightly toast the bread, then spread the toast with butter.",
            "step 3: To assemble, split the sausages in half and lay three halves on each of two slices of toast. Top the sausages with the bacon then spoon over the mushrooms and top with a second slice of toast. Spread over ketchup or brown sauce (or both), then squash the hash browns down a little and top each toast with two hash browns. Top the hash browns with an egg each, then top with the last slices of toast (spread with more sauce, if you like). Press down lightly on each sandwich and serve as they are or cut in half to get a runny yolk oozing out of each sandwich. Serve with a bowl of baked beans on the side."
        ],
        "nutrition_data": {
            "kcal": "991",
            "fat": "51g",
            "saturates": "16g",
            "carbs": "85g",
            "sugars": "13g",
            "fibre": "16ghigh",
            "protein": "41g",
            "salt": "4.74g"
        }
    },
    {
        "recipe_name": "Pain au chocolat",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/06/PainAuChoc-0ff983a.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "420gplain flour",
            "8gsea salt",
            "60gcaster sugar",
            "220gunsalted butter(at least 82% fat works best), 20g softened",
            "20gfresh yeastor 10g dried yeast",
            "1eggbeaten",
            "110mlwhole milk",
            "16dark chocolate batons"
        ],
        "recipe_steps": [
            "step 1: Make the dough in a stand mixer. Combine the flour, salt, sugar and 20g softened butter. Dissolve the yeast in around 80ml tepid water, around 38C, not too hot or it will kill the yeast. Add 20g of beaten egg and the milk to the stand mixer bowl. Pour in the yeast-water mixture and turn on to a low speed with a dough hook attachment for approximately 5 mins until the dough comes together to form a rough ball. Increase the speed to medium-high and knead for a further 6-10 mins until the dough is smooth. The exact time will depend on your stand mixer.",
            "step 2: Wrap the dough tightly and rest at room temperature for 10 mins. Unwrap and roll out the dough into a rectangle around 4mm thick, about 40 x 30cm. Wrap the dough rectangle and put in the freezer for 1 hr to rest or in the fridge overnight.",
            "step 3: Meanwhile, on a sheet of baking parchment, shape the remaining 200g butter into a flat rectangle (about 20 x 30cm) using a rolling pin. It should be around half the length of your dough rectangle, but the same width. Put in the fridge until needed – you want it to be cold but flexible.",
            "step 4: Take the chilled dough out of the fridge or freezer and lay the butter in the centre. Fold the dough edges in to meet at the centre, covering the butter. Rotate the dough 90 degrees and roll it out to about 40cm in length, keeping the same width. Handle the dough gently and return it to the fridge for 10-20 mins if it starts getting too warm.",
            "step 5: Repeat the process of folding the edges of the dough into the middle, then fold it over on itself again like a book (this is known as a double turn). Chill for 30 mins.",
            "step 6: Rotate the dough 90 degrees again. Roll it out long again and fold the edges in to meet in the middle. Chill for a further 30 mins.",
            "step 7: Roll out the dough to 32 x 30cm and cut 8 rectangles, 8 x 15cm each. Put a chocolate baton on one long edge of each rectangle, fold the dough inwards, then put the second chocolate baton next to the folded dough and roll the dough around the encase the chocolate, with the seams of the dough now facing down.",
            "step 8: Prove the pain au chocolat at 26-29°C (this is really important as proving at any higher temperature will mean the butter between the layers melts) for around 2-3 hrs, until doubled in size.",
            "step 9: Heat the oven to 175C/155C fan/gas 4, brush the pain au chocolat with the remaining egg and bake for 15-18 mins until golden brown and cooked through. Best eaten on the day but will keep in an airtight container for two days."
        ],
        "nutrition_data": {
            "kcal": "540",
            "fat": "31g",
            "saturates": "19g",
            "carbs": "54g",
            "sugars": "12g",
            "fibre": "4g",
            "protein": "8g",
            "salt": "1.04g"
        }
    },
    {
        "recipe_name": "Cheese omelette",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/01/Cheese-omelette-45155e3.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "2eggs",
            "½ tbspolive oil",
            "1 tbspbutter",
            "15gmature cheddarfinely grated"
        ],
        "recipe_steps": [
            "step 1: Crack the eggs into a jug and whisk well with a fork. Season with a pinch of salt.",
            "step 2: Heat the oil and butter in a medium non-stick frying pan over a medium-low heat. Once the butter has started to foam, pour in the eggs and tilt to cover the base of the pan. Using a spatula, gently draw in the eggs from four points so there are folds in the centre. Do this once or twice, then leave the eggs to cook gently for 2-3 mins, until there's a little raw egg still in the middle. Sprinkle over the cheese and, using your spatula, gently fold the omelette in half. Switch off the heat and let the residual heat from the pan melt the cheese for 1 min. Slide onto your plate and sprinkle over some black pepper to serve."
        ],
        "nutrition_data": {
            "kcal": "363",
            "fat": "33g",
            "saturates": "14g",
            "carbs": "0.1g",
            "sugars": "0.1g",
            "fibre": "0g",
            "protein": "17g",
            "salt": "0.95g"
        }
    },
    {
        "recipe_name": "Spicy Bloody Mary eggs with crunchy croutons",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/11/Spicy-bloody-Mary-eggs-with-crunchy-croutons-28bba25.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "2red onions1 sliced into rings, 1 finely chopped",
            "juice of ½lemonor lime",
            "1 tbspsugarplus a pinch",
            "splash ofvodka(optional)",
            "3 tbspolive oil",
            "1 stickceleryfinely chopped, plus leaves to garnish",
            "2 largegarlic cloveschopped",
            "2red pepperssliced",
            "2 x 400g canschopped tomatoes",
            "1 tbspred wine vinegar",
            "3red chillies",
            "2 chunky slices ofstale breadsuch as sourdough or ciabatta, torn into chunks",
            "5-10 shakes ofTabascoto taste",
            "8eggs",
            "150gGreek-style yogurt",
            "drizzle ofextra virgin olive oilto serve"
        ],
        "recipe_steps": [
            "step 1: Separate the rings of the sliced onions and put in a bowl with the citrus juice, a good pinch each of salt and sugar, and the vodka, if using. Leave to pickle for at least 30 mins until softened and pink. Will keep chilled for two weeks.",
            "step 2: Meanwhile heat 2 tbsp of the oil in a large, deep frying pan over a medium heat. Cook the chopped onion and celery for 5-8 mins until softened and translucent.",
            "step 3: Stir in the garlic and peppers, and sizzle for a few minutes. Add the tomatoes, vinegar, 1 tbsp sugar and some seasoning. Pierce each chilli a few times with the tip of a knife, add to the sauce, put the lid on and reduce the heat. Leave to simmer gently for 20 mins.",
            "step 4: Meanwhile, toss the chunks of bread in a bowl with the remaining oil and some freshly cracked black pepper. Tip onto a baking tray and bake in the oven or an air fryer for 10 mins at 180C/160C fan/gas 4, tossing halfway through cooking, until golden and crunchy.",
            "step 5: Taste the sauce and adjust the seasoning, adding a few splashes of Tabasco to make it as spicy as you like – it should be thick and rich at this stage. Lift out the whole chillies using a slotted spoon, if you prefer.",
            "step 6: Use a large spoon to create gaps in the sauce to drop the eggs into. Working one by one, crack an egg into a bowl then drop into a pocket in the sauce. Cover with a lid and leave to simmer gently for 3-5 mins until the egg whites are set and the yolks still runny.",
            "step 7: To serve, spoon dollops of yogurt over the exposed areas of sauce and scatter with the croutons, pickled onions and celery leaves. Give the eggs a twist of pepper and a drizzle of extra virgin olive oil and serve."
        ],
        "nutrition_data": {
            "kcal": "477",
            "fat": "23g",
            "saturates": "7g",
            "carbs": "41g",
            "sugars": "23g",
            "fibre": "7ghigh",
            "protein": "23g",
            "salt": "1.08g"
        }
    },
    {
        "recipe_name": "Protein pancakes with banana",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/05/Protein-pancakes-with-banana-51e78bb.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "3eggs",
            "75gporridge oats",
            "1 large,ripe banana",
            "2 tbspprotein powderany kind",
            "2 tbspmilkany kind",
            "1 tbspbaking powder",
            "¼ tspground cinnamon",
            "neutral oilfor the pan"
        ],
        "recipe_steps": [
            "step 1: Tip the eggs, oats, banana protein powder, milk, baking powder and cinnamon into a blender and blitz for 1-2 mins until smooth. Check the oats have broken down, if not, blitz for another minute.",
            "step 2: Heat a drizzle of oil in a pan. Pour or ladle in 2-3 rounds of batter, leaving a little space between each to spread. Cook for 1-2 mins until bubbles start to appear on the surface and the underside is golden. Flip over and cook for another minute until cooked through. Transfer to a warmed oven and repeat with the remaining batter.",
            "step 3: Serve topped with a dollop of Greek yogurt, sliced bananas and maple syrup."
        ],
        "nutrition_data": {
            "kcal": "400",
            "fat": "14g",
            "saturates": "3g",
            "carbs": "38g",
            "sugars": "10g",
            "fibre": "4g",
            "protein": "28ghigh",
            "salt": "2.17g"
        }
    },
    {
        "recipe_name": "Smashed peas on toast",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/04/Smashed-peas-on-toast-4c8c232.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "200gfreshly podded or frozen peas",
            "2mint stalksleaves finely chopped",
            "1lemonzested, plus a little juice",
            "1 tbspextra virgin olive oil",
            "2 slices ofbread(we used sourdough)",
            "2eggs(optional)",
            "pinch ofchilli flakes(optional)"
        ],
        "recipe_steps": [
            "step 1: Put the peas in a saucepan and cover with boiling water from the kettle. Cook over a medium heat for 1 min, then drain.",
            "step 2: Tip the peas into a bowl and mash with a fork. Add a pinch of salt, the mint, lemon zest, a squeeze of lemon juice and the olive oil, then mix well. Can be eaten warm or cold. Will keep chilled for a day.",
            "step 3: Toast the bread and poach eggs, if you like. Pile the smashed peas onto the hot toast, put an egg on top, if using, and sprinkle over some chilli flakes if you enjoy a bit of spice."
        ],
        "nutrition_data": {
            "kcal": "320",
            "fat": "8g",
            "saturates": "1g",
            "carbs": "44g",
            "sugars": "3g",
            "fibre": "7ghigh",
            "protein": "14g",
            "salt": "1.1g"
        }
    },
    {
        "recipe_name": "Lángos (Hungarian fried bread)",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/04/Smashed-peas-on-toast-4c8c232.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "7g sachetfast-action dried yeast",
            "1 tspcaster sugar",
            "500gplain flour",
            "¼ tspcaraway seeds",
            "200mlmilk",
            "200gsoured cream",
            "1½ litressunflower oilplus extra for proving and brushing"
        ],
        "recipe_steps": [
            "step 1: Put the yeast, sugar, flour, caraway seeds and 1 tsp salt in a bowl, mix together and set aside. Whisk the milk and soured cream together in a jug, then pour into the dry ingredients and mix well until everything comes together. Knead by hand or using a stand mixer for 5-6 mins until it comes together into a cohesive, sticky dough.",
            "step 2: Lightly oil a clean bowl and tip in the dough. Lightly brush over a bit more oil, then cover and leave to rise in a warm spot for 1-3 hrs, or until doubled in size.",
            "step 3: Pour the 1½ litres of oil into a large deep pan, ensuring it is no more than a third full, and heat to 170C over a medium heat, or until a cube of bread browns within 20-30 seconds. Lightly oil a clean work surface, your hands and a rolling pin, then cut the dough into 16 pieces. Roll each one out into a circle, then lift and pull using your hands until thin in the middle and thicker at the edge, like a pizza base.",
            "step 4: Line a baking tray with baking parchment. Carefully lay the dough circles into the hot oil, fry for 1 min, then carefully turn and fry for a further 1-2 mins until golden all over (you'll need to do this in batches – you may be able to fry two at a time). Transfer the fried lángos to the lined tray and keep warm in a low oven. Spread over the soured cream and top with the brynza and parsley to serve."
        ],
        "nutrition_data": {
            "kcal": "264",
            "fat": "14g",
            "saturates": "7g",
            "carbs": "26g",
            "sugars": "2glow",
            "fibre": "1g",
            "protein": "7g",
            "salt": "0.79g"
        }
    },
    {
        "recipe_name": "Upside-down apple pancakes",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2023/12/Upside-down-apple-pancakes--65bfaef.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "4dessert apples(about 475g), peeled and cored",
            "120ggolden caster sugar",
            "75gbuttermelted",
            "250gself-raising flour",
            "1½ tspbaking powder",
            "1 tspbicarbonate of soda",
            "1½ tspvanilla extract",
            "225mlbuttermilk",
            "2eggsbeaten"
        ],
        "recipe_steps": [
            "step 1: Heat the oven to 200C/180C fan/gas 6. Cut the apples into eighths. Sprinkle 100g of the sugar into an ovenproof, non-stick frying pan set over a medium heat. Cook, swirling the pan to evenly melt the sugar, for 5-6 mins until dark and dissolved. Carefully whisk in 50g of the butter and remove from the heat. Arrange the apple pieces over the butter, peeled-side down, and return to a low-medium heat. Cook for 3-4 mins until gently bubbling.",
            "step 2: Tip the remaining sugar into a bowl and mix with the flour, baking powder and bicarb. Melt the remaining 25g butter and tip into a jug, then mix in the vanilla extract, buttermilk and beaten eggs. Make a well in the middle of the dry ingredients and slowly pour in the wet mixture, whisking until fully combined. Be careful not to over-whisk – it’s fine if there are lumps. Pour the batter over the apples, using a spatula to level the top, and transfer to the oven. Bake for 20-25 mins until cooked.",
            "step 3: Remove from the oven, invert the pancake onto a plate and serve in wedges topped with the whipped cream and the cinnamon sprinkled over."
        ],
        "nutrition_data": {
            "kcal": "307",
            "fat": "10g",
            "saturates": "6g",
            "carbs": "47g",
            "sugars": "23g",
            "fibre": "2g",
            "protein": "6g",
            "salt": "1.1g"
        }
    },
    {
        "recipe_name": "Poached eggs with smoked salmon and bubble & squeak",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/bubble-857a9ea.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "1 tbsprapeseed oil",
            "140gwhite cabbagefinely chopped",
            "2spring onionsfinely sliced",
            "300gwhole new potato",
            "1 tbspsnipped chives",
            "2medium eggsat room temperature",
            "75gsmoked salmon"
        ],
        "recipe_steps": [
            "step 1: Cook the potatoes in a pan of boiling water until tender, then drain.",
            "step 2: Heat the oil in a non-stick frying pan or wok. Sweat the cabbage and the spring onions in the pan for a couple of mins. Meanwhile, chop and squash the potatoes roughly, then add to the pan along with the chives. Cook for 4-5 mins, flip it over (don’t worry if it breaks) and cook for a further 4-5 mins.",
            "step 3: Meanwhile, bring a small pan of water to a rolling boil, then reduce the heat so it is just simmering. Crack the eggs into the pan and simmer for about 3 mins until the whites are cooked and the yolk is just beginning to set. Remove with a slotted spoon and drain on kitchen paper.",
            "step 4: To serve, divide the bubble & squeak between 2 plates, place the smoked salmon and poached eggs on top and grind over a little black pepper, to taste."
        ],
        "nutrition_data": {
            "kcal": "310",
            "fat": "13g",
            "saturates": "2g",
            "carbs": "29g",
            "sugars": "5g",
            "fibre": "4g",
            "protein": "19g",
            "salt": "2g"
        }
    },
    {
        "recipe_name": "Potato fritters",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2023/09/Potato-fritters-179cb20.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "800g (3 large)potatoespeeled",
            "1onion",
            "3 tbspplain flour",
            "2eggslightly beaten",
            "3 tbspvegetable oil",
            "4 tbspsoured cream",
            "1 ripeavocadothinly sliced",
            "4eggsfried",
            "4spring onionstrimmed and finely sliced"
        ],
        "recipe_steps": [
            "step 1: Grate the potatoes and onion on a coarse box grater. Wrap in a clean tea towel and squeeze out as much liquid as possible. Transfer to a large bowl and mix in the flour and plenty seasoning. Stir in the egg.",
            "step 2: Heat a little of the oil in a large non stick frying pan. Use 2-3 tbsp of the mix per fritter and drop into the pan, cooking for 3-4 mins on each side over a medium-high heat, using a spatula to turn. Transfer to a plate lined with kitchen paper and continue with the remaining oil and mixture (it's best to cook in batches so as not to overcrowd the pan).",
            "step 3: Serve 3 fritters per person, each stack topped with the soured cream, avocado and a fried egg. Sprinkle over spring onions to serve."
        ],
        "nutrition_data": {
            "kcal": "589",
            "fat": "32g",
            "saturates": "7g",
            "carbs": "53g",
            "sugars": "5g",
            "fibre": "7ghigh",
            "protein": "19g",
            "salt": "0.4g"
        }
    },
    {
        "recipe_name": "Rhubarb & custard fluffy pancakes",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/01/Rhubarb-custard-fluffy-pancakes-614afb4.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "175gself-raising flour",
            "1 tspbaking powder",
            "1 tbspgolden caster sugar",
            "2 tbspcustard powder",
            "200mlmilk",
            "3eggs",
            "2 tbspbutter",
            "8 tbspthick custardwarmed"
        ],
        "recipe_steps": [
            "step 1: Heat the oven to 200C/180C fan/gas 6. Put all the ingredients for the rhubarb in a roasting tin, toss to coat, ensure the rhubarb is in a single layer, cover and roast for 12-14 mins until the rhubarb is soft but still holding its shape. Spoon into a bowl, then pour the roasting juices into a pan and simmer over a medium-high heat for 3-4 mins until syrupy.",
            "step 2: Whisk the flour, baking powder, sugar and custard powder together in a bowl. Add the milk and eggs, and whisk to a smooth batter. This is easier using a stick blender.",
            "step 3: Melt a small knob of the butter in a non-stick frying pan over a medium heat, carefully wiping it around the base using kitchen paper. Spoon in some batter to make 8cm circles, and cook for 1-2 mins until bubbles start to appear on the surface. Flip and cook for another 1-2 mins until golden and cooked through. Repeat with the remaining pancake batter and butter.",
            "step 4: Stack the pancakes up with the custard and poached rhubarb between each layer. Spoon over the rhubarb syrup to serve."
        ],
        "nutrition_data": {
            "kcal": "218",
            "fat": "6g",
            "saturates": "2g",
            "carbs": "33g",
            "sugars": "15g",
            "fibre": "2g",
            "protein": "7g",
            "salt": "0.2g"
        }
    },
    {
        "recipe_name": "Fried bread",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/01/Fried-bread-408ec8e.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "2 tbspneutral-tasting oil(grapeseed or sunflower work well), or 40g lard",
            "2 slicesthick white bread"
        ],
        "recipe_steps": [
            "step 1: Heat half the oil or lard in a frying pan over a medium-high heat. Once hot, fry the bread for 1 min 30 seconds until golden, then add the remaining oil or lard, turn the bread over and cook for another 1 min 30 seconds, until golden on both sides."
        ],
        "nutrition_data": {
            "kcal": "189",
            "fat": "16g",
            "saturates": "5g",
            "carbs": "10g",
            "sugars": "1g",
            "fibre": "1g",
            "protein": "2g",
            "salt": "0.22g"
        }
    },
    {
        "recipe_name": "Peanut butter-stuffed French toast",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/03/Peanut-butter-stuffed-French-toast-e119754.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "800gloaf white farmhouse bread",
            "4 tbspsmooth peanut butter",
            "3eggs",
            "1 tbspsugar",
            "50mlwhole milk",
            "pinch ofground cinnamon",
            "1 tspvanilla extract",
            "4 tbspvegetable oil",
            "5 tbspcondensed milk"
        ],
        "recipe_steps": [
            "step 1: Cut the loaf of bread into 8 slices, about 3.5cm thick, then remove the crusts from each slice (blitz these in a food processor to make breadcrumbs then freeze to use in another recipe). Spread the peanut butter over 4 slices of bread, then sandwich with the remaining slices and press down firmly around the edges to seal.",
            "step 2: Whisk the eggs, sugar, milk, cinnamon, vanilla and a pinch of salt together in a shallow dish. Heat a frying pan over medium heat, then pour in the oil. Briefly dunk the bread in the egg mixture, turning to coat on both sides. Shake off any excess, then fry for 3-4 mins. Flip over and repeat until golden on both sides, then remove to a plate lined with kitchen paper (you’ll need to do this in batches). To serve, drizzle over the condensed milk."
        ],
        "nutrition_data": {
            "kcal": "695",
            "fat": "27g",
            "saturates": "5g",
            "carbs": "85g",
            "sugars": "21g",
            "fibre": "5g",
            "protein": "24g",
            "salt": "1.8g"
        }
    },
    {
        "recipe_name": "Air-fryer fry-up",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/02/Air-fryer-fry-up-edfee1c.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "1English muffin",
            "½ tspbuttersoftened",
            "200gmushroomsroughly chopped",
            "½ tspolive oil",
            "1tomatohalved across the equator",
            "2sausages",
            "2hash browns",
            "1egg",
            "2bacon rashers",
            "½ 400g can or 200g canbaked beans(optional)"
        ],
        "recipe_steps": [
            "step 1: Heat the air-fryer to 180C. Slice the English muffin in half and cut a circle out of one half, leaving a 2cm-thick ring. Toast for 5-6 mins in the air-fryer, remove, then butter the whole half and press the other half onto it. Set aside.",
            "step 2: Put the mushrooms in a bowl and drizzle over the oil. Season with salt and pepper and stir to coat. Tip the mushrooms into the air-fryer and cook for 4 mins until beginning to soften. Season the cut halves of the tomato, then put in the air-fryer with the mushrooms and add the sausages, too. Cook for 2 mins before adding the hash browns and cook for another 4 mins.",
            "step 3: Meanwhile, crack the egg into a small cup or ramekin. Put the muffin on a plate, then pour the egg into the hole on top of the muffin. Set aside.",
            "step 4: At this point your air-fryer is likely to be quite full, so spoon the mushrooms on top of the tomatoes to make some room. Put the bacon on top of the sausages, then carefully nestle in the egg muffin. Cook for 8-10 mins. If your air-fryer is large enough, pour the beans into a ramekin and nestle in to cook as well. Alternatively, microwave the beans for 2 mins to heat through."
        ],
        "nutrition_data": {
            "kcal": "845",
            "fat": "44g",
            "saturates": "14g",
            "carbs": "61g",
            "sugars": "7g",
            "fibre": "9ghigh",
            "protein": "47g",
            "salt": "4.1g"
        }
    },
    {
        "recipe_name": "Breakfast hash",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2023/12/211220231703163239.jpeg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "2potatoescut into 2cm cubes (about 450g)",
            "3 rashersback bacon",
            "1red peppercut into 2cm cubes",
            "4eggs",
            "50gfetacrumbled",
            "small handful ofparsleyfinely chopped"
        ],
        "recipe_steps": [
            "step 1: Tip the potatoes into a pan of cold water with a generous pinch of salt. Bring to the boil, then reduce the heat and simmer for 10 mins until tender. Drain well and set aside to steam-dry. Meanwhile, put the bacon rashers in a 30cm wide ovenproof frying pan set over a medium heat and fry for 3-4 mins on both sides until almost crispy. Remove to a plate, leaving the fat behind in the pan, and set aside. Once cooled slightly, roughly cut into strips.",
            "step 2: Heat the oven to 200C/180C fan/gas 6 and heat the residual bacon fat in the pan over a medium heat, then tip in the potatoes. Stir well, then cook undisturbed for 3-5 mins. Mix in the peppers and season well. Cook, undisturbed, for 3 mins more. Stir, then cook for a further 2-4 mins until the potatoes are lightly browned. Stir in the bacon strips and cook for another 2 mins.",
            "step 3: Remove the pan from the heat and make four gaps in the mixture using the back of a spoon. Crack an egg into each and sprinkle over the feta. Bake in the oven for 6-8 mins, or until the eggs are cooked to your liking. Scatter over the parsley to serve."
        ],
        "nutrition_data": {
            "kcal": "488",
            "fat": "23g",
            "saturates": "9g",
            "carbs": "37g",
            "sugars": "5glow",
            "fibre": "5g",
            "protein": "30ghigh",
            "salt": "2.34g"
        }
    },
    {
        "recipe_name": "Chocolate-orange French toast",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2023/11/Chocolate-orange-French-toast-3968d43.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "4 thick slices ofbriochechallah or panettone",
            "2 tbspmarmalade",
            "40gdark chocolatebroken into pieces",
            "3eggs",
            "300mlwhole milk",
            "1 tspvanilla extract",
            "1orangezested, then peeled and sliced",
            "¼ tspground cinnamon",
            "2 tbspunsalted butter",
            "2 tbspmaple syrup",
            "icing sugarfor dusting",
            "yogurtor crème fraîche, to serve"
        ],
        "recipe_steps": [
            "step 1: Heat the oven to 140C/120C fan/gas 1. Cut a pocket into the side of each thick slice of bread using a small, sharp knife, then spoon in a quarter of the marmalade and poke a quarter of the chocolate into each pocket.",
            "step 2: Whisk the eggs, milk, vanilla, orange zest and cinnamon together in a shallow dish. Dip each slice of bread into the egg mixture, making sure both sides are fully coated.",
            "step 3: Melt ½ tbsp of the butter in a large frying pan over a medium heat. Lay a soaked bread slice in the pan and cook until golden brown and crispy, about 2-3 mins per side. Repeat with the remaining slices. Keep the toasted slices warm in a low oven while cooking the next, adding more butter as needed.",
            "step 4: Put the orange slices in a pan with the maple syrup and warm through over a low-medium heat until some of their juices are released. Dust the French toast with icing sugar and top with the yogurt, orange slices and warm maple-orange syrup."
        ],
        "nutrition_data": {
            "kcal": "538",
            "fat": "25g",
            "saturates": "15g",
            "carbs": "62g",
            "sugars": "33g",
            "fibre": "3g",
            "protein": "13g",
            "salt": "0.9g"
        }
    },
    {
        "recipe_name": "Next level kedgeree",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2023/10/Next-level-kedgeree-efb06c2.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "600mlchicken stock",
            "300gsmoked haddock fillets",
            "25gbutter",
            "1 largeonionsliced",
            "4garlic clovessliced",
            "thumb-sized piece ofgingerpeeled and chopped",
            "1 tspfennel seeds",
            "1 tspcumin seeds",
            "4cardamom podslightly crushed",
            "4bay leaves",
            "1 tbsptomato purée",
            "2 tspmild curry powder",
            "small bunch ofcorianderleaves picked, stalks chopped",
            "150mldouble cream",
            "250gbasmati rice",
            "4eggs",
            "100gfrozen peas(optional)",
            "¼lemonjuiced",
            "pinch ofgaram masalato serve"
        ],
        "recipe_steps": [
            "step 1: Bring the stock to a simmer in a saucepan, then add the smoked haddock and poach for 5 mins, or until just cooked through. Remove from the stock and flake into large chunks. Set aside. Will keep, covered and chilled, for up to two days. Reserve the poaching liquid.",
            "step 2: Melt the butter in a shallow pan over a medium heat and fry the onion, garlic, ginger, spices and bay leaves for 5-6 mins, or until the onions start to colour a little. Stir in the tomato purée, curry powder and coriander stalks, and cook for a few minutes until softened and sticky. Pour in the reserved stock and the cream. Season, stir, and bring to the boil. Reduce the heat and simmer for 15 mins to reduce the liquid by half. Strain through a sieve into a container, pressing the onions to squeeze out the liquid. Will keep covered and chilled, for up to two days.",
            "step 3: Rinse the rice in cold water several times, then put in a pan with enough cold water to cover by 1½cm. Cover the pan, then bring to the boil over a high heat. Stir, cover again, reduce the heat to low and cook undisturbed for 2 mins. Remove from the heat, leave for 10 mins, then fluff up using a fork. Cover again and leave for 5 mins. To get ahead, you can cook the rice the day before and keep chilled.",
            "step 4: Poach the eggs in a pan of simmering water (or make boiled eggs to your liking), then set aside on a sheet of kitchen paper to drain. Reheat the sauce in a large, shallow pan over a low heat until simmering, then stir in the cooked rice and frozen peas, if using, and cook until the rice is piping hot. Stir through most of the coriander leaves and lemon juice. Spoon into warm bowls and top with the poached eggs, the rest of the coriander and a sprinkling of garam masala. Serve straightaway."
        ],
        "nutrition_data": {
            "kcal": "549",
            "fat": "27g",
            "saturates": "16g",
            "carbs": "53g",
            "sugars": "6g",
            "fibre": "4g",
            "protein": "20g",
            "salt": "1.2g"
        }
    },
    {
        "recipe_name": "Family breakfast station",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/11/Family-breakfast-station-ad843f9.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "12smoked or unsmoked bacon rashers",
            "200gnatural yogurt",
            "drizzle of honey",
            "large handful of fresh mixed berries(we used raspberries, blueberries and halved strawberries)",
            "250gsoft cheese",
            "250gsmoked salmon",
            "small handful of lemon wedges",
            "1avocadopeeled, halved, stoned and sliced",
            "knob of butter",
            "10eggsbeaten",
            "50mldouble cream",
            "small bunch of chives",
            "6croissantswarmed",
            "6bagelsof your choice, toasted"
        ],
        "recipe_steps": [
            "step 1: Fry the bacon in a dry frying pan over a medium-high heat for 2 mins on each side, or until crisp. Spoon the yogurt into a small bowl, drizzle with honey and place on a shallow dish with the berries alongside. Spoon the soft cheese into a second small bowl, season with black pepper and put on a shallow dish alongside the salmon and lemon wedges. Put the avocado slices and bacon on another plate. Arrange all the dishes on a large serving tray, leaving space in the middle.",
            "step 2: Melt the butter in the frying pan over a low-medium heat. When foaming, pour in the eggs and stir with a spatula until set to your liking. Stir in the cream. Season. Tip into a bowl, scatter with the chives and put in the centre of the tray. Serve with the warm croissants and bagels."
        ],
        "nutrition_data": {
            "kcal": "830",
            "fat": "47g",
            "saturates": "20g",
            "carbs": "57g",
            "sugars": "15g",
            "fibre": "6ghigh",
            "protein": "42g",
            "salt": "3.7g"
        }
    },
    {
        "recipe_name": "Pancake breakfast tacos",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2023/12/Pancake-breakfast-tacos-142bea4.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "100gstreaky bacon",
            "125gself-raising flour",
            "1 tspbaking powder",
            "10ggolden caster sugar",
            "15gbuttermelted",
            "1 tspvanilla extract",
            "125mlmilk",
            "3egg",
            "½ tbspneutral-tasting oil",
            "2gchivesfinely chopped",
            "30gmature cheddargrated"
        ],
        "recipe_steps": [
            "step 1: Heat the oven to 200C/180C fan/gas 6 and arrange the bacon in a single layer on a baking tray. Bake for 12-14 mins until crisp. Meanwhile, combine the flour, baking powder and sugar in a bowl. Whisk the butter, vanilla, milk and egg together in a jug. Make a well in the centre of the dry ingredients and pour in the wet mixture, whisking to combine. Be careful not to over-whisk – it’s fine if there are lumps.",
            "step 2: Heat a little of the oil in a non-stick pan over a medium heat. Spoon in 2 tbsp batter and spread out into a 12cm circle. Cook for 2-3 mins until the edge is set and golden. Flip and cook for 1-2 mins more until set. Repeat to make four pancakes, keeping finished pancakes warm in a low oven while you cook the next.",
            "step 3: Meanwhile, for the maple butter, beat the ingredients together until smooth. For the scrambled eggs, whisk the eggs with a pinch of salt. Melt the butter in a frying pan over a medium heat. Once foaming, pour in the beaten egg, cook, undisturbed, for 20 seconds, then stir and cook for 1-2 mins more until set, light and fluffy. Don’t stir too often – you don’t want to break up the eggs too much.",
            "step 4: Spread the maple butter over the pancakes, then top with the eggs, bacon, chives and cheese."
        ],
        "nutrition_data": {
            "kcal": "1007",
            "fat": "68g",
            "saturates": "35g",
            "carbs": "65g",
            "sugars": "16g",
            "fibre": "3g",
            "protein": "31g",
            "salt": "4.2g"
        }
    },
    {
        "recipe_name": "Overnight oats",
        "recipe_image_link": "https://media.delight.video/0c18e53b610964fac175fe0e757adc30557e79b7/ecbac1863e9705426caec558fbf3d41aa94b2933/POSTER_USER/v2/4d73bd3b-f0fb-435a-a6ac-16d330ad382d.png?quality=90",
        "recipe_ingredients": [
            "¼ tspground cinnamon",
            "50grolled porridge oats",
            "2 tbspnatural yogurt",
            "50gmixed berries",
            "drizzle ofhoney",
            "½ tbspnut butter(we used almond)"
        ],
        "recipe_steps": [
            "step 1: The night before serving, stir the cinnamon and 100ml water (or milk) into your oats with a pinch of salt.",
            "step 2: The next day, loosen with a little more water (or milk) if needed. Top with the yogurt, berries, a drizzle of honey and the nut butter."
        ],
        "nutrition_data": {
            "kcal": "348",
            "fat": "11g",
            "saturates": "2g",
            "carbs": "46.07g",
            "sugars": "13g",
            "fibre": "6g",
            "protein": "13g",
            "salt": "0.17glow"
        }
    },
    {
        "recipe_name": "Air fryer bacon",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/04/Air-Fryer-Bacon-cc2a084.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "6 rashersstreaky baconor 3 rashers back bacon"
        ],
        "recipe_steps": [
            "step 1: Lay the bacon in a single layer in the base of an air fryer – be sure the layers aren't overlapping. The size of the air fryer basket will determine how many rashers you can cook at one time.",
            "step 2: Set the air fryer to 200C and cook streaky bacon rashers for 6-10 mins – just-cooked bacon will take 6 mins, but crispier bacon will take 9-10 mins. Cook back bacon rashers for 4-8 mins, depending on your preference. If you are cooking in batches, remember that the second batch will usually be quicker as the air fryer has heated up.",
            "step 3: Remove the bacon using tongs and put on kitchen paper to drain before serving."
        ],
        "nutrition_data": {}
    },
    {
        "recipe_name": "How to poach an egg",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/04/Air-Fryer-Bacon-cc2a084.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "1 tbspwhite wine vinegar",
            "eggsas many as you want to poach"
        ],
        "recipe_steps": [
            "step 1: Fill a large saucepan with water and add the vinegar. As soon as the water starts to boil, turn the heat down to a simmer.",
            "step 2: Crack the egg into a small bowl. For a perfect egg with no wispy white bits, crack into a fine strainer and allow the runnier egg white to drain off.",
            "step 3: Stir the water to create a gentle whirlpool which will help the egg white wrap around the yolk. Then carefully slide the egg into the water making sure the heat is low enough not to throw the egg around - there should only be small bubbles rising.",
            "step 4: Cook for 3-4 mins, until the white is cooked through.",
            "step 5: Remove gently using a slotted spoon and blot any water from the base on a tea towel or kitchen paper. You can add more than one egg to the pan but make sure each one has enough room."
        ],
        "nutrition_data": {}
    },
    {
        "recipe_name": "Smoky beans & baked eggs",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/04/Air-Fryer-Bacon-cc2a084.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "2 tbspoil",
            "1onionchopped",
            "1red peppersliced",
            "3garlic clovescrushed",
            "2 tspsmoked paprika",
            "1 tbspketchup",
            "400g can choppedtomatoes",
            "2 x 400g cans black orpinto beansdrained",
            "4-6eggsdepending on how hungry you are (adults may want 2 eggs each)",
            "handful ofcorianderleaves picked"
        ],
        "recipe_steps": [
            "step 1: Heat the oil in a wide, shallow pan and cook the onion for 8-10 mins until softened. Add the pepper and cook for another 5 mins, stirring regularly, until softened. Stir in the garlic, paprika and ketchup, then tip in the tomatoes, cover and leave to simmer gently for 10 mins. Remove the lid and cook for a few more minutes to thicken, then add the beans. Can be cooled and frozen in portions at this stage.",
            "step 2: Use a spoon to make 4-6 spaces in the mixture for the eggs – you should be able to see some of the bottom of the pan. Crack the eggs one by one into a cup or bowl and gently drop one into each hole. Cover the pan and reduce the heat to low. Cook for 3-5 mins until the egg whites are cooked through but the yolks are still runny. Scatter over the coriander to serve."
        ],
        "nutrition_data": {
            "kcal": "390low",
            "fat": "16g",
            "saturates": "2g",
            "carbs": "30g",
            "sugars": "12g",
            "fibre": "16g",
            "protein": "24g",
            "salt": "1.2g"
        }
    },
    {
        "recipe_name": "Baked oats",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/01/Easy-Classic-Baked-Oats-b173e46.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "100gporridge oats",
            "1 tspbaking powder",
            "1bananapeeled and chopped",
            "1 tbspmaple syrupor honey",
            "2eggs",
            "pinch ofmixed spiceor ground cinnamon",
            "100gchocolate chipsblueberries or raspberries, plus extra to serve",
            "flavourless oilfor the ramekins"
        ],
        "recipe_steps": [
            "step 1: If you're cooking them in the oven, heat it to 180C/160C fan/gas 4. Put the oats in a blender and pulse a few times until they start to resemble flour. Add the baking powder, chopped banana, maple syrup or honey, eggs and mixed spice or cinnamon, and whizz until smooth. Stir in the chocolate chips or berries.",
            "step 2: If using an air-fryer rather than an oven, heat the air fryer to 180C for 4 mins. Lightly oil four heatproof ramekins, then divide the batter between them. Bake for 8-10 mins in the air-fryer or 20-25 mins in the oven until well-risen and the baked oats spring back when lightly pressed. Scatter with more chocolate chips or berries before serving, if you like."
        ],
        "nutrition_data": {}
    },
    {
        "recipe_name": "Perfect scrambled eggs recipe",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/01/Easy-Classic-Baked-Oats-b173e46.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "2large free range eggs",
            "6 tbspsingle creamor full cream milk",
            "a knob ofbutter"
        ],
        "recipe_steps": [
            "step 1: Lightly whisk 2 large eggs, 6 tbsp single cream or full cream milk and a pinch of salt together until the mixture has just one consistency.",
            "step 2: Heat a small non-stick frying pan for a minute or so, then add a knob of butter and let it melt. Don’t allow the butter to brown or it will discolour the eggs.",
            "step 3: Pour in the egg mixture and let it sit, without stirring, for 20 seconds. Stir with a wooden spoon, lifting and folding it over from the bottom of the pan.",
            "step 4: Let it sit for another 10 seconds then stir and fold again.",
            "step 5: Repeat until the eggs are softly set and slightly runny in places. Remove from the heat and leave for a moment to finish cooking.",
            "step 6: Give a final stir and serve the velvety scramble without delay."
        ],
        "nutrition_data": {
            "kcal": "377",
            "fat": "33g",
            "saturates": "17g",
            "carbs": "2g",
            "sugars": "2glow",
            "fibre": "0g",
            "protein": "18.98ghigh",
            "salt": "0.6g"
        }
    },
    {
        "recipe_name": "Turbo beans & cheese on toast",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/04/220413_TURBO_BEANS_AND_CHEESE_ON_TOAST_0049_2-3edc6ea.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "2 tbspvegetable oilor other oil",
            "1 largeonionfinely chopped",
            "4garlic clovesfinely chopped",
            "1 tspsmoked paprikaplus extra for sprinkling",
            "1 tspground cumin",
            "chipotle chilli pasteto taste, or use chilli flakes (optional)",
            "200g canchopped tomatoesor passata",
            "2 x 400g cansbeans of your choice(kidney and cannellini work well), drained and rinsed",
            "4-8 slicescrusty bread",
            "150g gratedcheddar"
        ],
        "recipe_steps": [
            "step 1: Heat the oil in a heavy-based frying pan over a medium heat and fry the onion for 8-10 mins until softened and slightly caramelised. Add the garlic and spices, the chipotle chilli paste or chilli flakes, if using, and some seasoning. Fry for a few minutes more until the mixture is fragrant.",
            "step 2: Add the tomatoes, then swirl out the pan using 100ml water and add this too. Simmer for 10-15 mins until the mixture has thickened. Blitz the sauce using a hand blender, then taste for seasoning. Tip in the beans and mix well to coat. Warm through over a medium heat for 5 mins until the beans are piping hot.",
            "step 3: Heat the grill to high and toast the bread slices for 3-5 mins. Top with the beans and grated cheese, and pop under the grill until the cheese is melted and bubbling. Sprinkle with a little paprika and serve immediately."
        ],
        "nutrition_data": {
            "kcal": "554",
            "fat": "21g",
            "saturates": "9g",
            "carbs": "58g",
            "sugars": "10g",
            "fibre": "15ghigh",
            "protein": "26g",
            "salt": "1.4g"
        }
    },
    {
        "recipe_name": "Easy crêpes",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/pancakes-235859b.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "175gplain flour",
            "3large eggs",
            "450mlmilk",
            "sunflower oilfor frying"
        ],
        "recipe_steps": [
            "step 1: Weigh the flour in a large jug or bowl. Crack in the eggs, add half the milk and a pinch of salt. Whisk to a smooth, thick batter. Add the remaining milk and whisk again. Set aside for at least 30 mins.",
            "step 2: Heat a large non-stick crêpe pan or frying pan. Add a drizzle of oil, then wipe out the excess with kitchen paper. When the pan is hot, add enough batter to just cover the surface, swirling it and pouring any excess back into the bowl. The pancake should be as thin as possible. When the edges are peeling away from the sides of the pan, shake it to see if the pancake easily releases and is browning on the underside. If not, cook a little longer. Flip and cook the other side for a minute or two. Serve, or keep warm in a low oven."
        ],
        "nutrition_data": {
            "kcal": "161",
            "fat": "6g",
            "saturates": "2g",
            "carbs": "19g",
            "sugars": "3glow",
            "fibre": "1g",
            "protein": "7g",
            "salt": "0.2glow"
        }
    },
    {
        "recipe_name": "Prawn & egg on toast",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/03/Prawn-and-egg-on-toast-7dda648.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "3eggs",
            "250g peeled and cookedprawns(defrosted if frozen)",
            "3 tbspmayonnaise",
            "1lemonjuiced",
            "4 thick sliceswhite bread",
            "butterto serve",
            "small bunch ofchivesfinely sliced, to serve"
        ],
        "recipe_steps": [
            "step 1: Bring a medium pan of water to the boil, then carefully lower in the eggs and cook for 9 mins. Remove to a bowl of iced water using a slotted spoon and leave to stand for 10 mins until cold. Peel, then finely chop.",
            "step 2: Tip the chopped egg into a bowl along with the prawns. Stir in the mayonnaise and lemon juice, then season with salt and pepper.",
            "step 3: Toast the bread, then butter it. Spoon over the prawn and egg mayonnaise, then sprinkle with some chives and serve."
        ],
        "nutrition_data": {
            "kcal": "252",
            "fat": "14g",
            "saturates": "2g",
            "carbs": "13g",
            "sugars": "1g",
            "fibre": "1g",
            "protein": "19g",
            "salt": "1.4g"
        }
    },
    {
        "recipe_name": "Panettone French toast",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/11/French-toast-46d5eb5.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "3eggs",
            "150mlwhole milk",
            "1 tspmixed spice",
            "2 tbspdouble cream",
            "3 tbspbrandy",
            "40gunsalted butter",
            "4 tbspmixed dried fruit",
            "4slices panettone(around 320g), cut in half to make 8",
            "60gcrème fraîcheto serve",
            "maple syrupto serve (optional)",
            "2 tspicing sugarto serve"
        ],
        "recipe_steps": [
            "step 1: Tip the eggs, milk, mixed spice, double cream and 1 tbsp brandy into a jug and beat to combine, then pour the mixture into a large, shallow dish.",
            "step 2: Pour the remaining brandy into a cold frying pan along with 15g butter and the mixed fruit. Warm over a low heat for 3-4 mins until the butter has melted and the liquid has thickened slightly. Pour the fruit mixture into a small heatproof bowl and set aside.",
            "step 3: Lay the panettone slices in the egg mixture and flip over to soak. Do this quickly so it doesn’t break apart. Set aside on a plate.",
            "step 4: Melt the remaining butter over a medium-low heat in the frying pan you used earlier, and fry the panettone slices for 3-4 mins on each side until golden and cooked through. It’s easier to do this over a lower heat so the outside doesn’t burn before the centre cooks.",
            "step 5: Divide the slices between four plates, then top with the crème fraîche, mixed fruit, a little maple syrup (if using) and a dusting of icing sugar."
        ],
        "nutrition_data": {
            "kcal": "626",
            "fat": "33g",
            "saturates": "19g",
            "carbs": "62g",
            "sugars": "41g",
            "fibre": "3g",
            "protein": "13g",
            "salt": "0.7g"
        }
    },
    {
        "recipe_name": "Banana blueberry muffins",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/11/French-toast-46d5eb5.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "300gself-raising flour",
            "1 tspbicarbonate of soda",
            "100glight muscovado sugar",
            "50gporridge oatsplus 1 tbsp for topping",
            "2medium bananasthe riper the better",
            "284mlcarton buttermilk",
            "5 tbsplight olive oil",
            "2egg whites",
            "150gpunnet blueberries"
        ],
        "recipe_steps": [
            "step 1: Heat oven to 180C/160C fan/gas 4 and line a 12-hole muffin tin with paper muffin cases. Tip the flour and bicarbonate of soda into a large bowl. Hold back 1 tbsp of the sugar, then mix the remainder with the flour and 50g oats. Make a well in the centre. In a separate bowl, mash the bananas until nearly smooth. Stir the buttermilk, oil and egg whites into the mashed banana until evenly combined.",
            "step 2: Pour the liquid mixture into the well and stir quickly and sparingly with a wooden spoon. The mix will look lumpy and may have the odd fleck of flour still visible, but don’t be tempted to overmix. Tip in the blueberries and give it just one more stir. Divide the mix between the muffin cases – they will be quite full – then sprinkle the tops with the final tbsp of the oats and the rest of he sugar. Bake for 18-20 mins until risen and dark golden. Cool for 5 mins in the tray before lifting out onto a rack to cool completely."
        ],
        "nutrition_data": {
            "kcal": "202",
            "fat": "5g",
            "saturates": "0.8g",
            "carbs": "36g",
            "sugars": "14g",
            "fibre": "2g",
            "protein": "5g",
            "salt": "0.59g"
        }
    },
    {
        "recipe_name": "Carrot cake porridge",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/carrot-cake-porridge-f232cf6.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "2small  carrotspeeled and grated",
            "180gporridge oats",
            "1 tspcinnamon",
            "grating of freshnutmeg",
            "75graisins",
            "850mlmilk(cow’s or plant milk work well)",
            "1 tbspnut buttersuch as almond (optional)",
            "honeyto serve (optional)"
        ],
        "recipe_steps": [
            "step 1: Put all the ingredients apart from the honey in a pan and cook over a medium heat for 10-15 mins, stirring often, until the oats and carrots are soft and the porridge is creamy.",
            "step 2: Add a little more milk as it cooks if it’s too thick. Serve with a splash more milk and a drizzle of honey, if you like."
        ],
        "nutrition_data": {
            "kcal": "519",
            "fat": "16g",
            "saturates": "8g",
            "carbs": "73g",
            "sugars": "33g",
            "fibre": "8g",
            "protein": "17g",
            "salt": "0.5g"
        }
    },
    {
        "recipe_name": "Classic waffles",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/09/Classic-Waffles-0ae28b2.jpg?quality=90&resize=93,84",
        "recipe_ingredients": [
            "1egg",
            "225gself-raising flour",
            "1 tbspgolden caster sugar(optional)",
            "250mlmilk",
            "50gbuttermelted and cooled",
            "½ tspvanilla extract(optional)",
            "1 tbspsunflower or vegetable oil",
            "maple syrupand icing sugar, to serve (optional)"
        ],
        "recipe_steps": [
            "step 1: Crack the egg (for fluffier waffles, use only the yolk at this stage) into a large bowl, then tip in the flour and a generous pinch of salt. Add the sugar, if using, then gradually whisk in the milk followed by the melted butter until smooth. Whisk in the vanilla, if using. If you've chosen to make fluffier waffles, whisk the egg white to soft peaks, then gently fold this into the batter. Alternatively, make the batter by blitzing all the ingredients together using a blender or hand blender. Can be made 1-2 hrs ahead and chilled.",
            "step 2: Heat a waffle maker following the manufacturer's instructions and brush with a little of the oil.",
            "step 3: Then ladle in enough batter to just cover the surface.",
            "step 4: Cook following the manufacturer's instructions (usually 5-6 mins) until the waffles are golden brown and crisp.",
            "step 5: Serve immediately or keep warm in a low oven while you make the rest. Drizzle with maple syrup or sprinkle with icing sugar, if you like."
        ],
        "nutrition_data": {
            "kcal": "267",
            "fat": "12g",
            "saturates": "6g",
            "carbs": "34g",
            "sugars": "6g",
            "fibre": "2g",
            "protein": "6g",
            "salt": "0.55g"
        }
    },
    {
        "recipe_name": "One-pan eggs & peppers",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/05/One-pan-eggs-and-peppers-cbbc3d9.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "1 tbspolive oil",
            "2onions(320g), halved and thinly sliced",
            "1orange pepperhalved, deseeded and sliced",
            "1red chillideseeded and sliced",
            "400g canchopped tomatoes",
            "2 tbsptomato purée",
            "2 tspvegetable bouillon powder",
            "1 tsp driedoregano",
            "1 tspsmoked paprikaplus a little for sprinkling",
            "2 x 400g canschickpeas",
            "4eggs",
            "2 x 120g potsbio yogurt",
            "2garlic clovesfinely grated",
            "4 tbsp choppedparsley"
        ],
        "recipe_steps": [
            "step 1: Heat the oil over a medium heat in a large deep frying pan with a lid. Stir in the onions, then cover and leave to cook for 5 mins. Remove the lid and give the onions a stir – they should have softened and be starting to brown in places. Stir in the pepper and chilli, and cook for 2 mins, then tip in the tomatoes, tomato purée, bouillon, oregano, paprika and chickpeas, along with their liquid. Cover and turn the heat down to a simmer for 15 mins.",
            "step 2: Create two dips in the mixture with a spoon and crack 2 eggs into them. Cover and cook over a low heat for about 5 mins, until just set.",
            "step 3: Meanwhile, stir the yogurt with the garlic in a small bowl and sprinkle with paprika. Serve half the chickpea mixture with the cooked eggs. Serve half the yogurt on the side and sprinkle with half the parsley and a little paprika. Cool and chill the remainder. Will keep covered in the fridge for five days. If you're following our Healthy Diet Plan, save the rest for the following day. Reheat the chickpeas in a small pan with a dash of water, and cook the remaining eggs in it, as above. Sprinkle the remaining parsley and paprika on the yogurt, then serve."
        ],
        "nutrition_data": {
            "kcal": "384low",
            "fat": "13g",
            "saturates": "3g",
            "carbs": "38g",
            "sugars": "17g",
            "fibre": "11ghigh",
            "protein": "23g",
            "salt": "1.3g"
        }
    },
    {
        "recipe_name": "Blueberry & banana power smoothie",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/blueberry-banana-power-smoothie-5c9475a.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "2ripe  bananaspeeled",
            "125gblueberries(fresh or frozen)",
            "300g packsilken tofudrained",
            "2 tbspporridge oats"
        ],
        "recipe_steps": [
            "step 1: Whizz all of the ingredients together in a blender with 300ml water. Drink straight away or transfer to a bottle for later, shaking well before drinking."
        ],
        "nutrition_data": {
            "kcal": "160",
            "fat": "4glow",
            "saturates": "1g",
            "carbs": "23g",
            "sugars": "14g",
            "fibre": "2g",
            "protein": "7g",
            "salt": "0.01g"
        }
    },
    {
        "recipe_name": "Soft-boiled eggs",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/soft-boiled-eggs-with-chorizo-soldiers-1f5cd43.jpg?quality=90&resize=93,84",
        "recipe_ingredients": [
            "2 largefree-range eggsat room temperature",
            "toastto serve"
        ],
        "recipe_steps": [
            "step 1: Fill a medium sized saucepan with water and bring to a rolling boil.",
            "step 2: Make sure your eggs aren't fridge cold. By having the eggs at room temperature, it will be less of a shock for the egg reaching the hot water and therefore less likely to crack. You can also use an egg pricker to make a very small hole in each egg before boiling, which will also reduce the chances of it cracking in the heat. Slowly lower the eggs into the water using a spoon.",
            "step 3: Set your timer for 4-5 mins for runny/dippy eggs to serve with soldiers, or 6-7 mins for soft-boiled eggs for a salad. If serving in a salad, plunge the eggs into a bowl of cold water as soon as the timer goes off – this will stop them cooking and cool the shells quickly for peeling."
        ],
        "nutrition_data": {
            "kcal": "191low",
            "fat": "13g",
            "saturates": "4g",
            "carbs": "0g",
            "sugars": "0glow",
            "fibre": "0g",
            "protein": "19ghigh",
            "salt": "0.5g"
        }
    },
    {
        "recipe_name": "Eggy cheese crumpets",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/eggy-cheese-crumpets-b4b6d4c.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "3eggs",
            "50mlmilk",
            "6crumpets",
            "250gcherry tomatoeshalved",
            "drizzle ofvegetable oil",
            "40gcheddargrated",
            "2 small ripeavocadossliced"
        ],
        "recipe_steps": [
            "step 1: Heat the grill. Beat the eggs and milk together in a wide dish. Submerge the crumpets in the egg mixture, turning them once, then set aside for a few minutes.",
            "step 2: Arrange the tomatoes cut-side up on a baking tray and grill for a few minutes, then cover the tray with foil to keep the tomatoes warm.",
            "step 3: Heat the oil in a frying pan and cook the crumpets for a few minutes on each side until the egg has set – you may have to do this in batches. Transfer them to a baking tray as you go. Once all the crumpets are cooked, top with the cheese and grill for 1-2 mins until the cheese is bubbling and golden. Serve with the tomatoes and avocado slices."
        ],
        "nutrition_data": {
            "kcal": "545",
            "fat": "30g",
            "saturates": "9g",
            "carbs": "39g",
            "sugars": "6g",
            "fibre": "6g",
            "protein": "26g",
            "salt": "2.8g"
        }
    },
    {
        "recipe_name": "Banana oat pancakes",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/healthy-pancakes-61e4b14.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "125mloat milk",
            "2eggsseparated",
            "1small banana",
            "100grolled oats",
            "2 tspbaking powder",
            "few drops of vanilla extract",
            "oilwe used avocado oil spray",
            "low-fat yogurtand fruit to top"
        ],
        "recipe_steps": [
            "step 1: Put the oat milk, egg yolks, banana, oats, baking powder and vanilla in a blender and process to as smooth a mixture as you can get. Whisk the eggs whites until they hold stiff peaks. Whisk 1-2 tbsp of the whites into the batter, then fold in the rest.",
            "step 2: Heat a non-stick pan over a medium heat and spray with a whisper of oil, pour about 2 tbsp of batter into the pan and cook for 1-2 mins, until the base sets and bubbles appear all over the top. Flip and cook the other side for a minute. Repeat in batches, making sure the top looks dryish before attempting the flip, or the centre will collapse."
        ],
        "nutrition_data": {}
    },
    {
        "recipe_name": "Pancetta & pepper piperade",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/pancetta-pepper-piperade-509e3b8.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "2 x 70gpacks pancettapieces",
            "1red onionfinely chopped",
            "3peppers1 each of green, red and yellow, deseeded and finely diced",
            "400gcan chopped tomatoes",
            "2 tbsptomato purée",
            "4medium eggs",
            "small handfulbasil leavesshredded",
            "crusty breadto serve (optional)"
        ],
        "recipe_steps": [
            "step 1: Put the pancetta and onion in a large, deep frying pan. Cook for 7 mins until the onion is beginning to soften.",
            "step 2: Add the peppers, tomatoes and tomato purée to the pan and mix well. Season, cover and cook for 10-15 mins.",
            "step 3: Make 4 small wells in the mixture. Crack an egg into each well and cook for a further 5-6 mins or until the eggs have set. Scatter with basil and serve straight away, with crusty bread, if you like."
        ],
        "nutrition_data": {
            "kcal": "259",
            "fat": "15g",
            "saturates": "5g",
            "carbs": "13g",
            "sugars": "12g",
            "fibre": "5g",
            "protein": "15g",
            "salt": "1.3g"
        }
    },
    {
        "recipe_name": "Easy breakfast burritos",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/easy-breakfast-burritos-4ffc062.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "1 tbspolive oil",
            "4red peppersfinely sliced",
            "250gchestnut mushroomssliced",
            "8spicy or herby sausages"
        ],
        "recipe_steps": [
            "step 1: To make the beans, heat the oil in a pan and fry the onion for 5 mins until soft. Add both types of beans, the passata, chipotle paste, vinegar and sugar and simmer for 15 mins until thick and saucy. Season. Add more chipotle paste, sugar or vinegar to taste – it should be a balance of sweet, spicy and tangy. To make the salsa, combine all of the ingredients and season.",
            "step 2: Heat the oil in a large frying pan and fry the peppers and mushrooms for 10 mins until soft. Squeeze small chunks of sausagemeat from the sausage skins into the pan and fry for 10 mins more until golden and cooked through.",
            "step 3: Warm the tortillas, then keep warm in a clean tea towel. Put the avocados, coriander, cheese and lime wedges (if using) in bowls.",
            "step 4: Just before serving, make the scrambled eggs. Heat the butter in a pan and add the cumin seeds. Sizzle for 1 min, then add the eggs, stirring slowly, until scrambled. Season and tip into a warmed bowl. Serve everything in the middle of the table with chilli sauce, if using, and let everyone dig in."
        ],
        "nutrition_data": {
            "kcal": "577",
            "fat": "31g",
            "saturates": "10g",
            "carbs": "57g",
            "sugars": "12g",
            "fibre": "8g",
            "protein": "31g",
            "salt": "2.8g"
        }
    },
    {
        "recipe_name": "Chocolate porridge",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chocolate-porridge-ea3afa8.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "125gporridge oats",
            "4datesstoned",
            "500-600mlmilkany will work",
            "1 tbspcacaoor good quality cocoa powder",
            "yogurtand maple syrup, to serve (optional)"
        ],
        "recipe_steps": [
            "step 1: Blend half the oats and the dates in a food processor until you have a thick paste, adding a splash of milk to help the blades go round if necessary. Scrape the mixture into a saucepan and add the rest of the oats, 500ml milk, the cacao and a pinch of salt. Stir well and set over a low-medium heat.",
            "step 2: Stir the porridge every now and then for the next 5-10 mins, until it’s thick and creamy – add a splash more milk if you prefer a looser consistency. Serve with a dollop of yogurt and a drizzle of maple syrup, if you like."
        ],
        "nutrition_data": {
            "kcal": "222",
            "fat": "7g",
            "saturates": "3g",
            "carbs": "29g",
            "sugars": "8g",
            "fibre": "3g",
            "protein": "8g",
            "salt": "0.1g"
        }
    },
    {
        "recipe_name": "Salted caramel cheesecake pancakes",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2023/12/Salted-caramel-cheesecake-pancakes-76f8178.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "150gplain flour",
            "3eggs",
            "400mlmilk",
            "neutral-tasting oilfor frying",
            "150gsoft cheese",
            "75mldouble cream",
            "1 tbspicing sugar",
            "1 tspvanilla extract",
            "100g ready-madesalted caramelwarmed to loosen",
            "4shortbread biscuitsbashed to crumbs"
        ],
        "recipe_steps": [
            "step 1: Blitz the flour, eggs and milk in a jug until smooth using a stick blender. Leave to rest for 20 mins.",
            "step 2: Brush a little oil over the base of a crêpe pan, then wipe out with kitchen paper. Put over a medium heat and, once hot, ladle in a large spoonful of the batter, tipping the pan back and forth to coat the base in a thin layer. Cook for 1-2 mins until the edge starts to release from the pan and the pancake looks set, then flip and cook for 1 min more until lightly golden. Transfer to a warm plate and repeat with the remaining batter.",
            "step 3: Whisk the soft cheese, cream, sugar and vanilla together into a pillowy mixture that holds its shape. Spoon onto the pancakes, drizzle with the salted caramel, then scatter over the biscuit crumbs, fold up and serve straightaway."
        ],
        "nutrition_data": {
            "kcal": "611",
            "fat": "33g",
            "saturates": "19g",
            "carbs": "62g",
            "sugars": "25g",
            "fibre": "2g",
            "protein": "16g",
            "salt": "0.8g"
        }
    },
    {
        "recipe_name": "Breakfast casserole",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/11/Breakfast-casserole-a30fa3b.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "250gchestnut mushroomssliced",
            "1½ tbspvegetable oilplus extra for the tin (optional)",
            "6veggie sausagessliced into bite-sized pieces",
            "1large red onionfinely sliced",
            "2red peppersdeseeded and sliced",
            "8eggs",
            "250mlwhole milk",
            "125gcheddargrated",
            "10gchivesfinely sliced"
        ],
        "recipe_steps": [
            "step 1: Heat the oven to 200C/180C fan/gas 6. Fry the mushrooms in a large non-stick frying pan over a medium-high heat until the liquid has released and evaporated, about 8-10 mins. Add ½ tbsp oil and fry until golden, about 2 mins. Remove from the pan and tip into a large bowl.",
            "step 2: Wipe out the pan to remove any excess liquid, then return to a medium heat. Add the remaining oil and fry the sausages until golden all over. Remove using a slotted spoon and add to the bowl with the mushrooms. Fry the onions and peppers, stirring occasionally for 8-10 mins until soft but not browned. Tip into the bowl with the sausages and mushrooms, and mix everything together to combine. Season well. Tip the sausage and veg mixture into a baking dish (around 35 x 25cm) or roasting tin. If you’re using a tin, you may need to oil it to prevent the casserole from sticking.",
            "step 3: Combine the eggs, milk, cheddar and chives in a large jug, season well, then pour this over the ingredients in the dish or tin. Bake for 25-30 mins until golden and set. Leave to cool slightly before cutting into squares."
        ],
        "nutrition_data": {
            "kcal": "256",
            "fat": "16g",
            "saturates": "6g",
            "carbs": "8g",
            "sugars": "5g",
            "fibre": "3g",
            "protein": "18g",
            "salt": "0.9g"
        }
    },
    {
        "recipe_name": "Easy banana pancakes",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/11/Breakfast-casserole-a30fa3b.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "350gself-raising flour",
            "1 tspbaking powder",
            "2 very ripebananas",
            "2medium eggs",
            "1 tspvanilla extract",
            "250mlwhole milk",
            "butterfor frying"
        ],
        "recipe_steps": [
            "step 1: Sieve the flour, baking powder and a generous pinch of salt into a large bowl. In a separate mixing bowl, mash the very ripe bananas with a fork until smooth, then whisk in the eggs, vanilla extract and milk. Make a well in the centre of the dry ingredients, tip in the wet ingredients and swiftly whisk together to create a smooth, silky batter.",
            "step 2: Heat a little knob of butter in a large non-stick pan over a medium heat. Add 2-3 tbsp of the batter to the pan and cook for several minutes, or until small bubbles start appearing on the surface. Flip the pancake over and cook for 1-2 mins on the other side. Repeat with the remaining batter, keeping the pancakes warm in a low oven.",
            "step 3: Stack the pancakes on plates and top with the banana slices, a glug of sticky maple syrup and a handful of pecan nuts, if you like."
        ],
        "nutrition_data": {}
    },
    {
        "recipe_name": "Egg-in-the-hole smoked salmon & avocado toastie",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/toastie-0ae15f8.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "knob of butter",
            "2slices  white bread",
            "½ripe avocado",
            "½lemonplus a wedge to serve",
            "handful watercress",
            "1large egg",
            "few slices smoked salmon"
        ],
        "recipe_steps": [
            "step 1: Heat a large frying pan over a medium heat. Butter both sides of each slice of bread, then cut a large heart (or circle) out of the centre of one slice using a knife or biscuit cutter. Place the slices of bread, including the cut-out piece, into the frying pan and cook for 2 mins until golden. While the bread is cooking, slice the avocado and squeeze over the lemon juice. Toss the watercress in a little lemon juice, too.",
            "step 2: Flip the bread over, then crack the egg into the cut-out hole. After 1-2 mins, the whole slice of bread and cut-out piece should be golden brown on both sides. Transfer to a plate (eat the cut-out as a chef’s perk, if you like!). Cover the pan with a lid, or some foil, and lower the heat. Continue cooking for a further 1-2 mins until the egg is done to your liking.",
            "step 3: Top the toasted slice of bread with the avocado, smoked salmon and watercress, and season with a twist of pepper. Put the egg-in-the-hole slice on top and serve with an extra wedge of lemon, if you like."
        ],
        "nutrition_data": {
            "kcal": "415",
            "fat": "24g",
            "saturates": "7g",
            "carbs": "23g",
            "sugars": "2g",
            "fibre": "5g",
            "protein": "28g",
            "salt": "3.6g"
        }
    },
    {
        "recipe_name": "Homemade granola",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2010/02/Granola-a950f2b.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "2 tbspvegetable oil",
            "125mlmaple syrup",
            "2 tbsphoney",
            "1 tspvanilla extract",
            "300grolled oats",
            "50gsunflower seed",
            "4 tbspsesameseeds",
            "50gpumpkin seeds",
            "100gflaked almond",
            "100gdried berries(find them in the baking aisle)",
            "50gcoconutflakes or desiccated coconut"
        ],
        "recipe_steps": [
            "step 1: Heat oven to 150C/fan 130C/gas 2. Mix the oil, maple syrup, honey and vanilla in a large bowl. Tip in all the remaining ingredients, except the dried fruit and coconut, and mix well.",
            "step 2: Tip the granola onto two baking sheets and spread evenly. Bake for 15 mins, then mix in the coconut and dried fruit, and bake for 10-15 mins more. Remove and scrape onto a flat tray to cool. Serve with cold milk or yogurt. The granola can be stored in an airtight container for up to a month."
        ],
        "nutrition_data": {}
    },
    {
        "recipe_name": "Chorizo & halloumi breakfast baguette",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chorizo-and-halloumi-baguette-addaf63.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "1large avocado",
            "1limejuiced",
            "1red onionhalved and thinly sliced",
            "drizzle ofoil",
            "150gchorizosliced on an angle",
            "250gblock halloumisliced into 8 pieces",
            "1large baguetteor 2 smaller ones",
            "small bunchcorianderleaves picked"
        ],
        "recipe_steps": [
            "step 1: To make the tomato jam, put all the ingredients in a pan, season and simmer for 30 mins until you have a rich, thick glossy jam. Cool, then transfer to a sterilised jar (if you want to keep for over two weeks). Will keep, unopened, for six months.",
            "step 2: Halve the avocado and scoop into a bowl. Add half the lime juice and some salt and mash with a fork. Put the onion in a small bowl, pour over the rest of the lime juice and season with a pinch of salt. Mix well and set aside to lightly pickle.",
            "step 3: Heat a drizzle of oil in a large frying pan or heat an air-fryer to 200C for 4 mins. If you're using the hob, place the chorizo slices on one side of the pan and the halloumi on the other side, turning once the halloumi is golden and the chorizo is sizzling. Cook for about 4-5 mins in total. If you're using the air-fryer, arrange the chorizo slices and halloumi in one layer on opposite sides of the basket. If there isn't enough space, cook them separately in batches. Air-fry for 8-10 mins until the halloumi is golden and the chorizo is browned at the edges.",
            "step 4: Split the baguette and warm it in the air-fryer or oven for 1-2 mins. Spread the avocado over one side of the baguette and the tomato jam over the other. Fill the baguette with the halloumi, chorizo, coriander, and pickled red onions. Cut and serve."
        ],
        "nutrition_data": {
            "kcal": "872",
            "fat": "39g",
            "saturates": "17g",
            "carbs": "91g",
            "sugars": "38g",
            "fibre": "7g",
            "protein": "36g",
            "salt": "4.2g"
        }
    },
    {
        "recipe_name": "The breakfast club",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/04/BreakfastClubSandwich-2f85617.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "3 tbspsunflower oil",
            "4frozen hash browns",
            "3pork sausages",
            "4 rasherssmoked back bacon",
            "15gbutterplus extra for spreading",
            "100gchestnut mushroomssliced",
            "2eggs",
            "400g canbaked beans",
            "6 sliceswhite bread",
            "butterketchup and brown sauce, to serve"
        ],
        "recipe_steps": [
            "step 1: Heat the oven to 220C/200C fan/gas 7. Rub 1 tbsp of the oil over a large, shallow roasting tin. Put the hash browns on one half of the tin and line the sausages up on the other. Cook for 15 mins, then flip the hash browns, turn the sausages and return to the oven for 10-15 mins until the hash browns are golden, and the sausages browned. Push everything together to make room in the tin, then lay the bacon rashers in the space and return to the oven for 10-15 mins or until the bacon fat is crisp and sizzling.",
            "step 2: About 10 mins before the bacon is ready, heat 1 tbsp of oil with the butter in a frying pan until sizzling. Scatter in the mushrooms and season with salt and pepper. Fry over a high heat, tossing occasionally until softened and any liquid released has evaporated (about 5-10 mins), then tip onto a warm plate. Wipe out the pan, heat the rest of the oil and fry the eggs however you like them. While everything is cooking heat the baked beans in a saucepan or in the microwave and lightly toast the bread, then spread the toast with butter.",
            "step 3: To assemble, split the sausages in half and lay three halves on each of two slices of toast. Top the sausages with the bacon then spoon over the mushrooms and top with a second slice of toast. Spread over ketchup or brown sauce (or both), then squash the hash browns down a little and top each toast with two hash browns. Top the hash browns with an egg each, then top with the last slices of toast (spread with more sauce, if you like). Press down lightly on each sandwich and serve as they are or cut in half to get a runny yolk oozing out of each sandwich. Serve with a bowl of baked beans on the side."
        ],
        "nutrition_data": {
            "kcal": "991",
            "fat": "51g",
            "saturates": "16g",
            "carbs": "85g",
            "sugars": "13g",
            "fibre": "16ghigh",
            "protein": "41g",
            "salt": "4.74g"
        }
    },
    {
        "recipe_name": "Basic omelette recipe",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/04/BreakfastClubSandwich-2f85617.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "3eggsbeaten",
            "1 tspsunflower oil",
            "1 tspbutter"
        ],
        "recipe_steps": [
            "step 1: Season the beaten eggs well with salt and pepper. Heat the oil and butter in a non-stick frying pan over a medium-low heat until the butter has melted and is foaming.",
            "step 2: Pour the eggs into the pan, tilt the pan ever so slightly from one side to another to allow the eggs to swirl and cover the surface of the pan completely. Let the mixture cook for about 20 seconds then scrape a line through the middle with a spatula.",
            "step 3: Tilt the pan again to allow it to fill back up with the runny egg. Repeat once or twice more until the egg has just set.",
            "step 4: At this point you can fill the omelette with whatever you like – some grated cheese, sliced ham, fresh herbs, sautéed mushrooms or smoked salmon all work well. Scatter the filling over the top of the omelette and fold gently in half with the spatula. Slide onto a plate to serve."
        ],
        "nutrition_data": {
            "kcal": "277",
            "fat": "22g",
            "saturates": "7g",
            "carbs": "0g",
            "sugars": "0glow",
            "fibre": "0g",
            "protein": "20g",
            "salt": "0.8g"
        }
    },
    {
        "recipe_name": "Overnight oats",
        "recipe_image_link": "https://media.delight.video/0c18e53b610964fac175fe0e757adc30557e79b7/ecbac1863e9705426caec558fbf3d41aa94b2933/POSTER_USER/v2/4d73bd3b-f0fb-435a-a6ac-16d330ad382d.png?quality=90",
        "recipe_ingredients": [
            "¼ tspground cinnamon",
            "50grolled porridge oats",
            "2 tbspnatural yogurt",
            "50gmixed berries",
            "drizzle ofhoney",
            "½ tbspnut butter(we used almond)"
        ],
        "recipe_steps": [
            "step 1: The night before serving, stir the cinnamon and 100ml water (or milk) into your oats with a pinch of salt.",
            "step 2: The next day, loosen with a little more water (or milk) if needed. Top with the yogurt, berries, a drizzle of honey and the nut butter."
        ],
        "nutrition_data": {
            "kcal": "348",
            "fat": "11g",
            "saturates": "2g",
            "carbs": "46.07g",
            "sugars": "13g",
            "fibre": "6g",
            "protein": "13g",
            "salt": "0.17glow"
        }
    },
    {
        "recipe_name": "Cheesy skillet hash brown & eggs",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/02/Cheesy-skillet-hash-brown--50d781d.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "1 largeMaris Piper potato(about 250g), coarsely grated",
            "1eggbeaten",
            "1 tbspplain flour",
            "20gcheddargrated",
            "3spring onionsfinely sliced",
            "1 tbspvegetable oil"
        ],
        "recipe_steps": [
            "step 1: Heat the oven to 200C/180C fan/gas 6. Tip the grated potato into a clean tea towel and wring out any excess water. Transfer to a bowl and mix in the beaten egg, flour, cheese and half the spring onions. Season with plenty of salt and a grinding of black pepper.",
            "step 2: Brush a 20cm ovenproof skillet or frying pan with the oil and set over a medium heat. Once hot, press the hash brown mixture into the pan using the back of a spoon, making a well in the middle. Fry for 6-8 mins until golden.",
            "step 3: Transfer the hash brown to the oven and bake for 10 mins. For the toppings, break the egg into the gap and sprinkle the cheese over the hash brown. Bake for 8-10 mins until the potato is crisp and the egg white is set and the yolk runny (or cooked the way you prefer). Sprinkle over the remaining spring onions and the chilli flakes, if using."
        ],
        "nutrition_data": {
            "kcal": "661",
            "fat": "35g",
            "saturates": "12g",
            "carbs": "54g",
            "sugars": "3g",
            "fibre": "5g",
            "protein": "30g",
            "salt": "1.1g"
        }
    },
    {
        "recipe_name": "Middle Eastern eggs with merguez & pistachios",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/middle-eastern-eggs-with-merguez-pistachios-9036015.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "drizzle ofolive or rapeseed oil",
            "1small red onionchopped",
            "4merguez sausages",
            "15cherry tomatoeshalved",
            "pinch ofsugar(any will do)",
            "2 tspharissa paste(preferably rose harissa, as it’s fragrant and not too hot)",
            "2eggs",
            "2wholemeal pitta breads",
            "pinch ofsumacor paprika (optional)",
            "2 tbspGreek yogurt",
            "fewparsleysprigs, chopped",
            "1 tbspshelled pistachioroughly chopped"
        ],
        "recipe_steps": [
            "step 1: Heat a drizzle of oil in a heavy-bottomed, small frying pan – a cast-iron one is perfect. Add the onion and cook for a few mins until soft, then push them to one side of the pan. Add the sausages and fry for 5-10 mins, rolling them around in the pan until golden brown. Add the tomatoes, sugar and harissa, season well and add a splash of water. Cook for 5-10 mins, stirring now and then, until the tomatoes have cooked down to a thick, chunky sauce.",
            "step 2: Push the sausages aside in the pan so that you can create 2 large holes in the sauce using a spoon. Crack the eggs into the holes and cook for 4-5 mins until the whites are just set and the yolk is still runny. Meanwhile, toast the pitta breads.",
            "step 3: Sprinkle each egg with a little sumac, dollop on some yogurt, then sprinkle over the parsley and pistachios. Cut each pitta bread in half and serve on the side."
        ],
        "nutrition_data": {
            "kcal": "633",
            "fat": "35g",
            "saturates": "13g",
            "carbs": "40g",
            "sugars": "10g",
            "fibre": "7g",
            "protein": "36g",
            "salt": "2.1g"
        }
    },
    {
        "recipe_name": "Easy egg muffins",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/egg-muffins-5cf2ffe.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "1 tbspoil",
            "150gbroccolifinely chopped",
            "1red pepperfinely chopped",
            "2spring onionssliced",
            "6large eggs",
            "1 tbspmilk",
            "large pinch ofsmoked paprika",
            "50gcheddaror gruyère, grated",
            "small handful ofchiveschopped (optional)"
        ],
        "recipe_steps": [
            "step 1: Heat the oven to 200C/180C fan/gas 4. Brush half the oil in an 8-hole muffin tin. Heat the remaining oil in a frying pan and add the broccoli, pepper and spring onions. Fry for 5 mins. Set aside to cool.",
            "step 2: Whisk the eggs with the milk, smoked paprika and half the cheese in a bowl. Add the cooked veg. Pour the egg mixture into the muffin holes and top each with the remaining cheese and a few chives, if you like. Bake for 15-17 mins or until golden brown and cooked through."
        ],
        "nutrition_data": {
            "kcal": "229",
            "fat": "16g",
            "saturates": "5g",
            "carbs": "2g",
            "sugars": "2glow",
            "fibre": "2g",
            "protein": "17ghigh",
            "salt": "0.6g"
        }
    },
    {
        "recipe_name": "Ham & potato hash with baked beans & healthy ‘fried’ eggs",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/ham-potato-hash-with-baked-beans-healthy-fried-eggs-8075b24.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "600gpotatodiced",
            "1 Cal cooking sprayfor frying",
            "2leekstrimmed, washed and sliced",
            "175glean hamweighed after trimming and discarding any fat, chopped",
            "2 tbspwholegrain mustard",
            "5eggs",
            "2 x 415g cansreduced sugar & salt baked beans"
        ],
        "recipe_steps": [
            "step 1: Bring a large pan of salted water to the boil. Add the potatoes and boil for 5 mins until just tender. Drain well and leave in the colander to steam-dry.",
            "step 2: Meanwhile, spray an ovenproof pan with cooking spray. Add the leeks with a splash of water and fry until very soft and squishy. Add a few more sprays of the oil, tip in the potatoes along with the ham, and fry to crisp up a little. Heat oven to 200C/180C fan/gas 6.",
            "step 3: Stir in the mustard, 1 egg and a good amount of seasoning with a fork – break up some of the potatoes roughly as you do. Flatten down the mixture, spray the top with oil, and bake in the oven for 15-20 mins until the top is crisp.",
            "step 4: When the hash is nearly ready, heat 200ml water in a non-stick frying pan with a lid (or use a baking sheet as a lid). When it is steaming (but before it simmers), crack in the remaining 4 eggs and cover with a lid. Cook for 2-4 mins until the eggs are done to your liking. Meanwhile, heat the beans.",
            "step 5: Lift an egg onto each plate, add a big scoop of hash and spoon on some beans."
        ],
        "nutrition_data": {
            "kcal": "499low",
            "fat": "15glow",
            "saturates": "4g",
            "carbs": "49g",
            "sugars": "10g",
            "fibre": "13g",
            "protein": "37g",
            "salt": "3.6g"
        }
    },
    {
        "recipe_name": "Matcha miso pancakes",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2023/12/Matcha-miso-pancakes-b6b824f.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "100mlmilk",
            "handful ofspinach leaves(about 30g)",
            "1 tbspmatcha powder",
            "200gself-raising flour",
            "1 tspbaking powder",
            "1 tbsplight brown soft sugar",
            "3eggslightly beaten",
            "2 tbspunsalted butter",
            "whipped creamto serve"
        ],
        "recipe_steps": [
            "step 1: First, make the caramel. Warm the sugar in a pan (without stirring) over a medium heat until starting to melt around the edge and turn golden. Continue to cook, tipping the pan back and forth, until all the sugar has dissolved and an amber caramel has formed, about 5-6 mins. Whisk in the butter, then stir in the cream, a pinch of sea salt flakes and the miso. Bubble for a minute, then remove from the heat and leave to cool to room temperature. (It will thicken further as it cools.)",
            "step 2: Blitz the milk, spinach and matcha together in a jug using a hand blender until smooth. Whisk the flour, baking powder and sugar together in a bowl, then pour in the wet ingredients, including the beaten eggs. Whisk until smooth.",
            "step 3: Melt a little of the butter in a frying pan over a medium heat and spoon in the pancake batter – you want your pancakes to be about 12cm wide. (You will need to make them in batches.) Cook for 1-2 mins until bubbles start to appear, then flip and cook for another 1-2 mins until cooked through and lightly golden. Repeat with the remaining batter, using more butter as needed.",
            "step 4: Stack two pancakes per person, then top with the whipped cream and miso caramel."
        ],
        "nutrition_data": {
            "kcal": "594",
            "fat": "30g",
            "saturates": "17g",
            "carbs": "66g",
            "sugars": "26g",
            "fibre": "2g",
            "protein": "13g",
            "salt": "1.62g"
        }
    },
    {
        "recipe_name": "Chai-spiced apple & sultana porridge topper",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2023/12/Matcha-miso-pancakes-b6b824f.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "100gsultanas",
            "2applescored and roughly chopped",
            "½lemonjuiced",
            "2 tbsplight brown soft sugar",
            "¾ tspground ginger",
            "¾ tspground cinnamon",
            "¼ tspground nutmeg",
            "5cardamom podsbashed",
            "2cloves"
        ],
        "recipe_steps": [
            "step 1: Put the sultanas, apples, lemon juice, sugar, ground and whole spices and a crack of black pepper in a saucepan. Pour in 75ml water, then bring to a simmer over a medium heat. Cook gently for 10-15 mins until the fruit has softened and the liquid has reduced. Remove from the heat and set aside. Once cool, will keep chilled in an airtight container for up to five days.",
            "step 2: To make the porridge, tip the oats, milk and 800ml water into a saucepan along with a pinch of salt. Cook, stirring often, over a medium heat for 8-10 mins until thickened and creamy – cook for slightly longer if you prefer a thicker porridge, or add a splash of water if you prefer it thinner.",
            "step 3: Serve the porridge in bowls topped with the chai-spiced apple and sultana mixture and a drizzle of double cream, if you like."
        ],
        "nutrition_data": {
            "kcal": "384",
            "fat": "8g",
            "saturates": "3g",
            "carbs": "65g",
            "sugars": "31g",
            "fibre": "5g",
            "protein": "10g",
            "salt": "0.1g"
        }
    },
    {
        "recipe_name": "Potato & spring onion breakfast pancakes",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/potato-spring-onion-breakfast-pancakes-6ad7292.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "140gfloury potatoes(weighed after peeling), cut into large chunks",
            "50gself-raising flour",
            "½ tspbicarbonate of soda",
            "3large eggs",
            "5 tbspmilk",
            "3spring onionsfinely chopped",
            "2 tspsunflower oilplus extra if needed",
            "knob ofbutter",
            "6rashers streaky bacon(smoked or unsmoked)"
        ],
        "recipe_steps": [
            "step 1: Put the potatoes in a large pan of salted water and boil until tender. Drain well, tip back into the pan, shake for 1 min over a gentle heat to dry them off, then mash and leave to cool.",
            "step 2: Put the cooled mash in a bowl with the flour and bicarb. Whisk 1 egg with the milk, season, tip into the bowl and whisk until smooth. Stir in the spring onions, reserving some to serve.",
            "step 3: In a non-stick frying pan, heat half the oil and butter until sizzling, then spoon in half the pancake batter to make 3 pancakes. Cook for 1 min or so on each side until browned and set underneath, then flip and cook the other side. Keep warm in the oven while you make 3 more pancakes.",
            "step 4: Wipe out the pan, add the bacon and sizzle until almost crisp. Push to one side and crack in the 2 remaining eggs – with a splash more oil if needed. Fry to your liking, then serve with the pancakes and bacon, sprinkled with the remaining spring onions."
        ],
        "nutrition_data": {
            "kcal": "553",
            "fat": "33g",
            "saturates": "11g",
            "carbs": "31g",
            "sugars": "3g",
            "fibre": "3g",
            "protein": "31g",
            "salt": "4.3g"
        }
    },
    {
        "recipe_name": "Tropical breakfast bars",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/tropical-breakfast-bars-31ec8ab.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "3 tbspvegetable oilplus extra for the tin",
            "2large, very ripe bananas",
            "1large eggbeaten",
            "70glight brown soft sugar",
            "250gnutty muesli",
            "100gtropical dried fruit mix"
        ],
        "recipe_steps": [
            "step 1: Heat the oven to 180C/160C fan/gas 4. Lightly oil and line a 20cm deep square tin with baking parchment.",
            "step 2: Mash the bananas in a bowl until smooth, then stir through the oil, egg and sugar. Fold through the muesli, most of the tropical mix and a pinch of salt. Spoon the mixture into the tin and sprinkle with the remaining tropical mix. Bake for 35-40 mins, leave to cool in the tin, then turn out on to a board and slice into 10 bars. Will keep in an airtight container for four days."
        ],
        "nutrition_data": {
            "kcal": "205",
            "fat": "6g",
            "saturates": "0.4g",
            "carbs": "33g",
            "sugars": "23g",
            "fibre": "3g",
            "protein": "4g",
            "salt": "0.04g"
        }
    },
    {
        "recipe_name": "Big breakfast courgette & potato rösti",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/rosti-81e7f65.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "400gpotatograted",
            "200gcourgettegrated",
            "3spring onionsfinely sliced",
            "4eggsand 1 yolk",
            "2 tbspplain flour",
            "little sunflower oil or butterfor frying",
            "8rashers of your favourite  bacon",
            "tomato ketchup or chutneyto serve"
        ],
        "recipe_steps": [
            "step 1: Put the grated potatoes and courgettes in a clean tea towel and squeeze out as much water as you can. Tip into a bowl with the spring onions, egg yolk, flour and plenty of seasoning. Mix well.",
            "step 2: Heat oven to 180C/160C fan/gas 4. Put a little oil and butter in a frying pan. Divide the mixture into 4 flat röstis and add to the pan (fry as many as you can fit in your pan at once). Cook over a medium heat for 6-8 mins until the underside is crisp and brown, then flip over and cook the other side. When they’re cooked, transfer to a baking parchment-lined tray and put in the oven.",
            "step 3: While the röstis are finishing off in the oven, fry the bacon in the pan, then transfer to the oven, too. Finally, fry the eggs to your liking, then serve with the courgette röstis, crisp bacon and a good blob of tomato ketchup or chutney."
        ],
        "nutrition_data": {
            "kcal": "277",
            "fat": "14g",
            "saturates": "4g",
            "carbs": "25g",
            "sugars": "2g",
            "fibre": "3g",
            "protein": "13g",
            "salt": "0.3g"
        }
    },
    {
        "recipe_name": "Brioche breakfast bake with crispy bacon",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/brioche-breakfast-bake-with-crispy-bacon-7bf0b52.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "3large eggs",
            "150mldouble cream",
            "200mlmilk",
            "2 tbspmaple syrupplus extra to serve",
            "2 tspvanilla extract",
            "200gpunnet blueberries",
            "8briocherolls, each one split in half (if your dish is shallow, cut in half again the other way to make shorter pieces)",
            "50gpecanhalves",
            "6-8 rashersbacon",
            "icing sugarfor dusting"
        ],
        "recipe_steps": [
            "step 1: In a large bowl, whisk together the eggs, cream, milk, maple syrup, vanilla and a pinch of salt. Tip about two-thirds of the blueberries into a baking dish (about 20cm x 30cm) that is quite deep. Dip each brioche piece into the egg mixture until well soaked, then arrange on top on the blueberries and pour any remaining egg mixture over the top. Scatter over the remaining blueberries. Cover with cling film and chill for 1 hr, or overnight if serving it for breakfast.",
            "step 2: Heat oven to 180C/160C fan/gas 4. Uncover the dish and scatter over the pecans. Bake for 25 mins until the egg mixture is set and the blueberries are starting to burst. Meanwhile, line a baking tray with foil and arrange the bacon on top. When the brioche bake is ready, remove from the oven and cover loosely with foil to keep warm. Heat the grill to high and cook the bacon for about 5 mins each side until crispy.",
            "step 3: Dust the brioche bake with icing sugar and top with the crispy bacon. Serve with extra maple syrup for drizzling."
        ],
        "nutrition_data": {
            "kcal": "520",
            "fat": "36g",
            "saturates": "15g",
            "carbs": "34g",
            "sugars": "15g",
            "fibre": "2g",
            "protein": "14g",
            "salt": "1.6g"
        }
    },
    {
        "recipe_name": "Blackberry & white chocolate porridge topper",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/08/Blackberry-and-white-chocolate--b343c0e.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "300gblackberries",
            "1lemonjuiced",
            "100gcaster sugar",
            "100gwhite chocolateroughly chopped",
            "4 tbspmixed seeds"
        ],
        "recipe_steps": [
            "step 1: Tip the blackberries, lemon juice, sugar and 1 tbsp water into a saucepan. Bring to a simmer over a medium heat. Cook for 5-6 mins until the blackberries have softened and broken down slightly, then remove from the heat. Set aside. Once cool, will keep chilled in an airtight container for up to five days.",
            "step 2: Meanwhile, make the porridge. Tip the oats, milk and 800ml water into a saucepan along with a pinch of salt. Cook, stirring often, over a medium heat for 8-10 mins until thickened and creamy – cook for slightly longer if you prefer a thicker porridge, or add a splash of water if you prefer it thinner. The more you stir, the creamier it will become. Stir in the white chocolate until it has completely melted.",
            "step 3: Spoon the porridge into bowls and swirl through the blackberry mixture, then scatter over the seeds."
        ],
        "nutrition_data": {
            "kcal": "572",
            "fat": "19g",
            "saturates": "8g",
            "carbs": "82g",
            "sugars": "47g",
            "fibre": "8ghigh",
            "protein": "14g",
            "salt": "0.2g"
        }
    },
    {
        "recipe_name": "Baked green eggs",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/baked-green-eggs-c5e7f38.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "100gbaby spinachroughly chopped",
            "4 tbspfresh pesto",
            "100mldouble cream",
            "1 tbspfinely grated gruyère(or vegetarian alternative)",
            "4medium eggs"
        ],
        "recipe_steps": [
            "step 1: Heat oven to 200C/180C fan/gas 6. Mix together the spinach, pesto, cream and some seasoning, and tip into 2 individual shallow ovenproof dishes. Sprinkle the cheese over the top. Make 2 shallow hollows in the mixture in each dish and break an egg into each hollow. Bake in the oven for 10-12 mins until the whites are set and the yolks are still runny."
        ],
        "nutrition_data": {
            "kcal": "579",
            "fat": "54g",
            "saturates": "23g",
            "carbs": "3g",
            "sugars": "3g",
            "fibre": "3g",
            "protein": "19g",
            "salt": "1.5g"
        }
    },
    {
        "recipe_name": "Shakshuka",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-12141_11-fd804a3.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "1 tbspolive oil",
            "2red onionschopped",
            "1red chillideseeded and finely chopped",
            "1garlic clovesliced",
            "small bunchcorianderstalks and leaves chopped separately",
            "2 canscherry tomatoes",
            "1 tspcaster sugar",
            "4eggs"
        ],
        "recipe_steps": [
            "step 1: Heat the oil in a frying pan that has a lid, then soften the onions, chilli, garlic and coriander stalks for 5 mins until soft. Stir in the tomatoes and sugar, then bubble for 8-10 mins until thick. Can be frozen for 1 month.",
            "step 2: Using the back of a large spoon, make 4 dips in the sauce, then crack an egg into each one. Put a lid on the pan, then cook over a low heat for 6-8 mins, until the eggs are done to your liking. Scatter with the coriander leaves and serve with crusty bread."
        ],
        "nutrition_data": {}
    },
    {
        "recipe_name": "Hash browns with gruyère & pancetta",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/hash-browns-with-gruyere-07815dc.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "800gMaris Piper or King Edward potatoes",
            "1 ½ tbspolive oil",
            "1small onionfinely diced",
            "2garlic cloves",
            "75gpancettadiced",
            "50ggruyèregrated",
            "small packparsleychopped",
            "2large eggslightly beaten",
            "roasted cherry tomatoesand mushrooms, to serve (optional)"
        ],
        "recipe_steps": [
            "step 1: Peel the potatoes, cut them into large chunks and put them in a saucepan of cold salted water. Bring to the boil and simmer for 15 mins until just cooked (do not overcook or the potatoes will absorb too much water).",
            "step 2: Meanwhile, heat 1⁄2 tbsp of the olive oil in a small pan. Add the onion, garlic and a pinch of salt, then cover and cook over a low heat for 15-20 mins until the onion is soft and starting to caramelise. If the onion starts to catch, add a splash of cold water. Remove the onion and garlic, then fry the pancetta in the same pan until the fat has melted and the pancetta is crisp.",
            "step 3: Drain the potatoes and allow to steam-dry. Once cool enough to handle, chop the potatoes into 1cm dice and mix in a bowl with the pancetta, gruyère, parsley, beaten eggs, onion and garlic. Season generously with black pepper.",
            "step 4: Heat 1 tbsp of the oil in a large non-stick frying pan. Gently tip in the potato mixture and press down with the back of a large spoon. Fry over a medium heat for 15 mins until the bottom is golden brown. Tip the hash brown onto a plate, then slide back into the pan, cooked-side up. Cook for another 15 mins until golden and hot. Serve with roasted tomatoes and mushrooms, if you like."
        ],
        "nutrition_data": {
            "kcal": "356",
            "fat": "17g",
            "saturates": "6g",
            "carbs": "35g",
            "sugars": "2g",
            "fibre": "4g",
            "protein": "15g",
            "salt": "0.9g"
        }
    },
    {
        "recipe_name": "Mushroom croque monsieur rolls",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/10/CroqueMonsieur-616a2c5.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "25gbutter",
            "25gplain flour",
            "250mlwhole milk",
            "1 tbspwholegrain mustard",
            "1bay leaf",
            "grating ofnutmeg",
            "2 tbspolive oil",
            "300gclosed-cup mushroomsfinely sliced",
            "a fewthyme sprigsleaves picked",
            "320gpuff pastry sheet",
            "60ggruyèrefinely grated",
            "100gsmoked ham slicesroughly torn",
            "1eggbeaten"
        ],
        "recipe_steps": [
            "step 1: Start by making a béchamel sauce. Heat the butter in a saucepan over a medium heat until melted and foaming, then stir in the flour and cook for 2-3 mins, stirring well until the flour has darkened slightly. Pour in the milk, a splash at a time, whisking well after each addition. Bring to a simmer and stir in the mustard, bay leaf and nutmeg. Bubble gently, stirring occasionally for 5-7 mins until thickened and reduced. Season to taste, then set aside and leave to cool to room temperature.",
            "step 2: Heat the olive oil in a frying pan over a medium-high heat. Stir in the mushrooms and thyme and fry for 5-7 mins until golden all over. Tip out onto a plate and spread out to cool to room temperature.",
            "step 3: If you’re prepping ahead, line a freezerproof container with baking parchment. Unroll the pastry sheet and spread over the cooled béchamel sauce, leaving a 3cm border on the longest side furthest away from you. Scatter over the cooled mushrooms, gruyère, and arrange the ham slices on top, leaving the border free. Brush the border with a little water. Starting from the long end closest to you, roll up tightly, using the parchment to help, pressing with your fingers to seal. Cut into eight even pieces and stuff any bits that fall out back in. Will keep frozen for up to three months. Arrange the unbaked scrolls in a single layer in the prepared container.",
            "step 4: Heat the oven to 200C/180C fan/gas 6. Lift the scrolls using the baking parchment, and transfer to a large baking tray. Space well apart, as they will puff up in the oven. Generously brush the sides and tops of the scrolls with the beaten egg. Bake for about 30 mins or 45-50 mins from frozen until golden, bubbling and puffed up. Leave to cool on the baking tray for 15 mins to firm up before serving warm. Will keep chilled in an airtight container for up to two days."
        ],
        "nutrition_data": {
            "kcal": "304",
            "fat": "21g",
            "saturates": "10g",
            "carbs": "17g",
            "sugars": "2g",
            "fibre": "2g",
            "protein": "10g",
            "salt": "0.9g"
        }
    },
    {
        "recipe_name": "Spicy Moroccan eggs",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/moroccan-eggs-9b67cbc.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "2 tsprapeseed oil",
            "1large  onionhalved and thinly sliced",
            "3garlic clovessliced",
            "1 tbsprose harissa",
            "1 tspground coriander",
            "150mlvegetable stock",
            "400gcan  chickpea",
            "2 x 400g cans cherry tomatoes",
            "2courgettesfinely diced",
            "200gbag baby spinach",
            "4 tbspchopped coriander",
            "4large eggs"
        ],
        "recipe_steps": [
            "step 1: Heat the oil in a large, deep frying pan, and fry the onion and garlic for about 8 mins, stirring every now and then, until starting to turn golden. Add the harissa and ground coriander, stir well, then pour in the stock and chickpeas with their liquid. Cover and simmer for 5 mins, then mash about one-third of the chickpeas to thicken the stock a little.",
            "step 2: Tip the tomatoes and courgettes into the pan, and cook gently for 10 mins until the courgettes are tender. Fold in the spinach so that it wilts into the pan.",
            "step 3: Stir in the chopped coriander, then make 4 hollows in the mixture and break in the eggs. Cover and cook for 2 mins, then take off the heat and allow to settle for 2 mins before serving."
        ],
        "nutrition_data": {
            "kcal": "242low",
            "fat": "10g",
            "saturates": "2g",
            "carbs": "22g",
            "sugars": "11g",
            "fibre": "8g",
            "protein": "16g",
            "salt": "1g"
        }
    },
    {
        "recipe_name": "Avocado on toast with chorizo & fried eggs",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chorizo-b339764.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "1 tbsppumpkin seed",
            "85gchorizosliced into chunks",
            "1large ripe avocadostoned and peeled",
            "juice ½ lime",
            "½small pack corianderchopped",
            "2eggs",
            "4thick-cut slices wholemeal bread"
        ],
        "recipe_steps": [
            "step 1: Heat a large frying pan, add the pumpkin seeds and toast for a few mins until they crack and pop, then tip out into a bowl and set aside. Add the chorizo and cook for 5 mins until it releases some of its oils and becomes crisp. Meanwhile, roughly mash the avocado with the lime juice, half the coriander and a pinch of salt.",
            "step 2: Heat a griddle pan and cook the bread for a few mins each side, or pop in the toaster. Push the chorizo to the edge of the frying pan, crack in the eggs and fry to your liking.",
            "step 3: To serve, divide the toast between 2 plates, spread with the mashed avocado, and pile on the chorizo, fried eggs and pumpkin seeds. Scatter with the remaining coriander."
        ],
        "nutrition_data": {
            "kcal": "522",
            "fat": "37g",
            "saturates": "10g",
            "carbs": "25g",
            "sugars": "3g",
            "fibre": "4g",
            "protein": "23g",
            "salt": "1.5g"
        }
    },
    {
        "recipe_name": "Oven-baked egg & chips",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1201515_11-b0d0217.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "2medium baking potatoescut into chunky wedges",
            "2 tbspolive oil",
            "1 tspsmoked paprika",
            "2tomatoeshalved",
            "2eggs"
        ],
        "recipe_steps": [
            "step 1: Heat oven to 190C/170C fan/gas 5. Tip the potato wedges into a roasting tin. Drizzle over the oil and sprinkle over the paprika. Season and mix well to coat the potatoes. Roast for 25 mins, turning halfway through, until almost tender.",
            "step 2: Nestle the tomatoes, cut-side up, amongst the potatoes. Make 2 spaces in the tin and crack an egg into each one. Return to the oven for 6-8 mins until the eggs are just set."
        ],
        "nutrition_data": {
            "kcal": "303",
            "fat": "19g",
            "saturates": "3g",
            "carbs": "25g",
            "sugars": "3g",
            "fibre": "3g",
            "protein": "11g",
            "salt": "0.26glow"
        }
    },
    {
        "recipe_name": "Parsnip hash browns",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1201456_10-424d8ff.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "450gwaxy  potato(such as Charlotte)",
            "350gparsnipor other root veg",
            "1smallonionhalved and thinly sliced",
            "1garlic clovefinely chopped",
            "1eggbeaten",
            "4-5 tbspsunflower oil"
        ],
        "recipe_steps": [
            "step 1: Peel and coarsely grate the potatoes and parsnips – if you’re using a food processor, attach the medium grater. Squeeze out as much liquid as possible with your hands and put them in a bowl.",
            "step 2: Stir in the onion, garlic, egg and season if you like. Divide the mixture into six and roughly shape into flat cakes. Heat 2 tbsp of the oil in a large non-stick frying pan and fry three of the cakes on a low heat for 4-5 mins on each side until golden and tender. Transfer to kitchen paper with a slotted spoon and leave to cool while frying the remainder, adding remaining oil as necessary. Meanwhile grill the bacon and tomatoes, poach the eggs and serve alongside."
        ],
        "nutrition_data": {
            "kcal": "179",
            "fat": "9g",
            "saturates": "1g",
            "carbs": "21g",
            "sugars": "0g",
            "fibre": "4g",
            "protein": "4g",
            "salt": "0.06glow"
        }
    },
    {
        "recipe_name": "Full English potato cake",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1158567_11-a6f568a.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "1 ½kgpotatodiced into 1cm chunks",
            "4 tbspolive oilplus extra for drizzling",
            "6spring onionsfinely chopped",
            "2thymesprigs, leaves stripped, plus 1 sprig left whole",
            "25gbuttermelted, plus extra for greasing",
            "12rashers  streaky bacon",
            "3large  plum tomatoeshalved",
            "cracked  black pepper",
            "6medium eggs",
            "buttered  toastto serve",
            "brown and tomato sauce, tea and  orange juiceto serve (optional)"
        ],
        "recipe_steps": [
            "step 1: Bring a big saucepan of salted water to the boil. Tip in the potatoes and simmer until almost tender, about 20 mins. Drain really well and steam dry for a few mins. Return to the pan and toss with 2 tbsp of the oil, the spring onions, thyme leaves and lots of seasoning.",
            "step 2: Grease your largest baking tray with some melted butter and press the potatoes into it. Put a baking sheet on top and gently press down to squash the spuds into a cake. Cover and chill until ready for breakfast.",
            "step 3: Heat oven to 220C/200C fan/gas 7. Drizzle the melted butter and remaining oil over the potato cake and bake for 30 mins until golden.",
            "step 4: Add the bacon in a few piles and bake for another 15 mins. Dot over the tomato halves and the remaining thyme sprig, sprinkle with plenty of pepper, then crack the eggs among the gaps and bake for 5-8 mins, depending how you like your eggs.",
            "step 5: To serve, cut the potato cake into portions and pile onto 6 plates, along with the eggs, bacon, tomatoes and some buttered toast. Serve with brown and tomato sauce, tea and orange juice, if you like."
        ],
        "nutrition_data": {
            "kcal": "448",
            "fat": "23g",
            "saturates": "7g",
            "carbs": "42g",
            "sugars": "3g",
            "fibre": "4g",
            "protein": "18g",
            "salt": "1.8g"
        }
    },
    {
        "recipe_name": "Sausage & egg baps with spicy tomato sauce",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-984578_11-8d0bbc0.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "12Cumberland sausages",
            "1 tspvegetable oil",
            "4large eggs",
            "4large soft white or wholemeal baps"
        ],
        "recipe_steps": [
            "step 1: Place all the ingredients for the sauce in a large pan. Cook over a medium-high heat for 10-12 mins until most of the liquid has evaporated and the tomatoes have broken down, leaving you with a thick, spoonable sauce.",
            "step 2: Squeeze the sausagemeat from the skins and shape into 4 flat patties. Heat the oil in a large frying pan. Cook the patties for 4 mins each side, squashing them down with the back of a spatula, until crisp and golden on both sides. Remove from the pan and keep warm.",
            "step 3: Heat the grill. Crack the eggs into the pan and cook to your liking. Meanwhile, slice open the baps and lightly toast, cut-side up, under the grill. Add a spoonful of the spicy tomato sauce to each bap, then a sausage patty, then top with a fried egg."
        ],
        "nutrition_data": {
            "kcal": "747",
            "fat": "49g",
            "saturates": "17g",
            "carbs": "45g",
            "sugars": "14g",
            "fibre": "2g",
            "protein": "31g",
            "salt": "4.6g"
        }
    },
    {
        "recipe_name": "Spinach baked eggs with parmesan & tomato toasts",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-981473_11-2fdd325.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "400gfresh  spinach",
            "100gBasil, parmesan (or vegetarian alternative) & tomato butter",
            "4eggs",
            "8-12slices  French stick"
        ],
        "recipe_steps": [
            "step 1: Heat oven to 190C/fan 170C/gas 5. Wash the spinach and trim off any thick stalks. Put into a large pan, then cook, covered, until the spinach is wilted, about 2-3 mins. Drain well, pressing out all excess water, then return to the pan with about a quarter of the butter, stirring until the spinach is glistening.",
            "step 2: Heat grill to high. Divide the spinach between 4 buttered ramekins, then break an egg into each. Season with salt and pepper, then top with a slice of butter. Bake for 10-12 mins, until the eggs are just set. Meanwhile, grill the bread on one side until crisp, then spread the untoasted side with the remaining butter and grill again until crisp. Serve the eggs with the toast on the side."
        ],
        "nutrition_data": {
            "kcal": "494",
            "fat": "33g",
            "saturates": "18g",
            "carbs": "31g",
            "sugars": "4g",
            "fibre": "4g",
            "protein": "20g",
            "salt": "2.23g"
        }
    },
    {
        "recipe_name": "Veggie breakfast bakes",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1201575_11-aa3f8c6.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "4large field mushrooms",
            "8tomatoeshalved",
            "1garlic clovethinly sliced",
            "2 tspolive oil",
            "200gbag spinach",
            "4eggs"
        ],
        "recipe_steps": [
            "step 1: Heat oven to 200C/180C fan/gas 6. Put the mushrooms and tomatoes into 4 ovenproof dishes. Divide garlic between the dishes, drizzle over the oil and some seasoning, then bake for 10 mins.",
            "step 2: Meanwhile, put the spinach into a large colander, then pour over a kettle of boiling water to wilt it. Squeeze out any excess water, then add the spinach to the dishes. Make a little gap between the vegetables and crack an egg into each dish. Return to the oven and cook for a further 8-10 mins or until the egg is cooked to your liking."
        ],
        "nutrition_data": {
            "kcal": "127",
            "fat": "8g",
            "saturates": "2g",
            "carbs": "5g",
            "sugars": "5g",
            "fibre": "3g",
            "protein": "9g",
            "salt": "0.4glow"
        }
    },
    {
        "recipe_name": "Healthy egg & chips",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1201496_12-652bd94.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "500gpotatoesdiced",
            "2shallotssliced",
            "1 tbspolive oil",
            "2 tspdried crushed oreganoor 1 tsp fresh leaves",
            "200gsmall mushroom",
            "4eggs"
        ],
        "recipe_steps": [
            "step 1: Heat oven to 200C/fan 180C/gas 6. Tip the potatoes and shallots into a large, non-stick roasting tin, drizzle with the oil, sprinkle over the oregano, then mix everything together well. Bake for 40-45 mins (or until starting to go brown), add the mushrooms, then cook for a further 10 mins until the potatoes are browned and tender.",
            "step 2: Make four gaps in the vegetables and crack an egg into each space. Return to the oven for 3-4 mins or until the eggs are cooked to your liking."
        ],
        "nutrition_data": {
            "kcal": "218",
            "fat": "10g",
            "saturates": "2g",
            "carbs": "22g",
            "sugars": "1g",
            "fibre": "2g",
            "protein": "11g",
            "salt": "0.24glow"
        }
    },
    {
        "recipe_name": "Chorizo & halloumi breakfast baguette",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chorizo-and-halloumi-baguette-addaf63.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "1large avocado",
            "1limejuiced",
            "1red onionhalved and thinly sliced",
            "drizzle ofoil",
            "150gchorizosliced on an angle",
            "250gblock halloumisliced into 8 pieces",
            "1large baguetteor 2 smaller ones",
            "small bunchcorianderleaves picked"
        ],
        "recipe_steps": [
            "step 1: To make the tomato jam, put all the ingredients in a pan, season and simmer for 30 mins until you have a rich, thick glossy jam. Cool, then transfer to a sterilised jar (if you want to keep for over two weeks). Will keep, unopened, for six months.",
            "step 2: Halve the avocado and scoop into a bowl. Add half the lime juice and some salt and mash with a fork. Put the onion in a small bowl, pour over the rest of the lime juice and season with a pinch of salt. Mix well and set aside to lightly pickle.",
            "step 3: Heat a drizzle of oil in a large frying pan or heat an air-fryer to 200C for 4 mins. If you're using the hob, place the chorizo slices on one side of the pan and the halloumi on the other side, turning once the halloumi is golden and the chorizo is sizzling. Cook for about 4-5 mins in total. If you're using the air-fryer, arrange the chorizo slices and halloumi in one layer on opposite sides of the basket. If there isn't enough space, cook them separately in batches. Air-fry for 8-10 mins until the halloumi is golden and the chorizo is browned at the edges.",
            "step 4: Split the baguette and warm it in the air-fryer or oven for 1-2 mins. Spread the avocado over one side of the baguette and the tomato jam over the other. Fill the baguette with the halloumi, chorizo, coriander, and pickled red onions. Cut and serve."
        ],
        "nutrition_data": {
            "kcal": "872",
            "fat": "39g",
            "saturates": "17g",
            "carbs": "91g",
            "sugars": "38g",
            "fibre": "7g",
            "protein": "36g",
            "salt": "4.2g"
        }
    },
    {
        "recipe_name": "The breakfast club",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/04/BreakfastClubSandwich-2f85617.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "3 tbspsunflower oil",
            "4frozen hash browns",
            "3pork sausages",
            "4 rasherssmoked back bacon",
            "15gbutterplus extra for spreading",
            "100gchestnut mushroomssliced",
            "2eggs",
            "400g canbaked beans",
            "6 sliceswhite bread",
            "butterketchup and brown sauce, to serve"
        ],
        "recipe_steps": [
            "step 1: Heat the oven to 220C/200C fan/gas 7. Rub 1 tbsp of the oil over a large, shallow roasting tin. Put the hash browns on one half of the tin and line the sausages up on the other. Cook for 15 mins, then flip the hash browns, turn the sausages and return to the oven for 10-15 mins until the hash browns are golden, and the sausages browned. Push everything together to make room in the tin, then lay the bacon rashers in the space and return to the oven for 10-15 mins or until the bacon fat is crisp and sizzling.",
            "step 2: About 10 mins before the bacon is ready, heat 1 tbsp of oil with the butter in a frying pan until sizzling. Scatter in the mushrooms and season with salt and pepper. Fry over a high heat, tossing occasionally until softened and any liquid released has evaporated (about 5-10 mins), then tip onto a warm plate. Wipe out the pan, heat the rest of the oil and fry the eggs however you like them. While everything is cooking heat the baked beans in a saucepan or in the microwave and lightly toast the bread, then spread the toast with butter.",
            "step 3: To assemble, split the sausages in half and lay three halves on each of two slices of toast. Top the sausages with the bacon then spoon over the mushrooms and top with a second slice of toast. Spread over ketchup or brown sauce (or both), then squash the hash browns down a little and top each toast with two hash browns. Top the hash browns with an egg each, then top with the last slices of toast (spread with more sauce, if you like). Press down lightly on each sandwich and serve as they are or cut in half to get a runny yolk oozing out of each sandwich. Serve with a bowl of baked beans on the side."
        ],
        "nutrition_data": {
            "kcal": "991",
            "fat": "51g",
            "saturates": "16g",
            "carbs": "85g",
            "sugars": "13g",
            "fibre": "16ghigh",
            "protein": "41g",
            "salt": "4.74g"
        }
    },
    {
        "recipe_name": "Basic omelette recipe",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/04/BreakfastClubSandwich-2f85617.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "3eggsbeaten",
            "1 tspsunflower oil",
            "1 tspbutter"
        ],
        "recipe_steps": [
            "step 1: Season the beaten eggs well with salt and pepper. Heat the oil and butter in a non-stick frying pan over a medium-low heat until the butter has melted and is foaming.",
            "step 2: Pour the eggs into the pan, tilt the pan ever so slightly from one side to another to allow the eggs to swirl and cover the surface of the pan completely. Let the mixture cook for about 20 seconds then scrape a line through the middle with a spatula.",
            "step 3: Tilt the pan again to allow it to fill back up with the runny egg. Repeat once or twice more until the egg has just set.",
            "step 4: At this point you can fill the omelette with whatever you like – some grated cheese, sliced ham, fresh herbs, sautéed mushrooms or smoked salmon all work well. Scatter the filling over the top of the omelette and fold gently in half with the spatula. Slide onto a plate to serve."
        ],
        "nutrition_data": {
            "kcal": "277",
            "fat": "22g",
            "saturates": "7g",
            "carbs": "0g",
            "sugars": "0glow",
            "fibre": "0g",
            "protein": "20g",
            "salt": "0.8g"
        }
    },
    {
        "recipe_name": "Overnight oats",
        "recipe_image_link": "https://media.delight.video/0c18e53b610964fac175fe0e757adc30557e79b7/ecbac1863e9705426caec558fbf3d41aa94b2933/POSTER_USER/v2/4d73bd3b-f0fb-435a-a6ac-16d330ad382d.png?quality=90",
        "recipe_ingredients": [
            "¼ tspground cinnamon",
            "50grolled porridge oats",
            "2 tbspnatural yogurt",
            "50gmixed berries",
            "drizzle ofhoney",
            "½ tbspnut butter(we used almond)"
        ],
        "recipe_steps": [
            "step 1: The night before serving, stir the cinnamon and 100ml water (or milk) into your oats with a pinch of salt.",
            "step 2: The next day, loosen with a little more water (or milk) if needed. Top with the yogurt, berries, a drizzle of honey and the nut butter."
        ],
        "nutrition_data": {
            "kcal": "348",
            "fat": "11g",
            "saturates": "2g",
            "carbs": "46.07g",
            "sugars": "13g",
            "fibre": "6g",
            "protein": "13g",
            "salt": "0.17glow"
        }
    },
    {
        "recipe_name": "Potato & dill pancakes with gravadlax",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-957454_10-7ddf462.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "1medium potato(about 250g/10oz), left whole, unpeeled",
            "140g/ 5ozplain flour",
            "2eggs",
            "1 tbspbaking powder",
            "oilfor frying",
            "1 tbspchopped dill",
            "200ml/ 7fl ozmilk"
        ],
        "recipe_steps": [
            "step 1: Cook the potato whole for about 12 mins, until tender but not cooked all the way through. Cool under cold water, then grate with the skin on – you’ll need 150g (5 ¼oz) grated potato. Tip the flour into a large bowl with a pinch of salt and crack in the eggs. Whisk until lump-free. Gradually add the milk, whisking well. Add the potato, dill and the baking powder and stir well.",
            "step 2: Heat a little oil in a frying pan and cook 2 tbsp of the batter at a time. When you see tiny bubbles appear on the top, turn and cook on the other side for about 1 min. Keep warm while you cook the rest.",
            "step 3: Meanwhile, mix the salad ingredients. Serve the pancakes topped with gravadlax and the mixed salad."
        ],
        "nutrition_data": {
            "kcal": "288",
            "fat": "8glow",
            "saturates": "2g",
            "carbs": "33g",
            "sugars": "4g",
            "fibre": "3g",
            "protein": "23g",
            "salt": "3.6g"
        }
    },
    {
        "recipe_name": "Smoky bean, bacon & eggy bread bake",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-932498_11-d9ec285.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "3 x 400g cans haricot beandrained and rinsed",
            "500gpassata",
            "½ tbspsweet smoked paprika",
            "1 tbspred wine vinegar",
            "1 tbspdark muscovado sugar",
            "2 tspWorcestershire sauce",
            "200gbacon lardon",
            "5eggs",
            "125mlmilk",
            "10slices white breadcrusts removed and halved to make triangles"
        ],
        "recipe_steps": [
            "step 1: Heat oven to 220C/200C fan/gas 7. Tip the beans into a large baking dish with the passata, paprika, vinegar, sugar and Worcestershire sauce. Season and mix well. Scatter the lardons over the top, cover with foil and bake for 30 mins.",
            "step 2: Remove the beans from the oven, take off the foil and stir well. Return to the oven, uncovered, for 10 mins to crisp up the bacon. You can now cool and chill the beans for up to 2 days, or freeze for up to 3 months. Just defrost and warm through before continuing.",
            "step 3: Whisk the eggs and milk with some seasoning. Dip the bread triangles into the egg mix, then layer them over the surface of the beans. Pour the rest of the egg over the bread and cook for 20 mins, or until the bread is puffed and golden."
        ],
        "nutrition_data": {
            "kcal": "418",
            "fat": "16g",
            "saturates": "5g",
            "carbs": "46g",
            "sugars": "11g",
            "fibre": "9g",
            "protein": "23g",
            "salt": "2.5g"
        }
    },
    {
        "recipe_name": "Easy vegan pancakes",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/vegan_pancakes-4595444.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "300gself-raising flour",
            "1 tspbaking powder",
            "1 tbspsugar(any kind)",
            "1 tbspvanilla extract",
            "400mlplant-based milk(such as oat, almond or soya)",
            "1 tbspvegetable oilfor cooking"
        ],
        "recipe_steps": [
            "step 1: Whisk the flour, baking powder, sugar, vanilla extract and a pinch of salt in a bowl using a balloon whisk until mixed. Slowly pour in the milk until you get a smooth, thick batter.",
            "step 2: Heat a little of the oil in a non-stick frying pan over a medium-low heat, and add 2 tbsp batter into the pan at a time to make small, round pancakes. You will need to do this in batches of two-three at a time. Cook for 3-4 mins until the edges are set, and bubbles are appearing on the surface. Flip the pancakes over and cook for another 2-3 mins until golden on both sides and cooked through. Keep warm in a low oven while you cook the remaining pancakes.",
            "step 3: Serve stacked with lots of toppings of your choice, or serve with bowls of toppings for everyone to help themselves."
        ],
        "nutrition_data": {}
    },
    {
        "recipe_name": "Full English frittata with smoky beans",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-870482_11-ba5d355.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "2low-fat  sausagessliced",
            "4rashers extra lean baconall fat removed, chopped",
            "150gpack button mushroomhalved, or larger ones quartered",
            "8egg whitesor use 350ml liquid egg whites from a carton",
            "3 tbspmilk",
            "140gcherry tomatohalved",
            "2 x 400g cans reduced salt and sugar baked beans",
            "1 ½ tspsmoked paprika",
            "small bunchchivessnipped"
        ],
        "recipe_steps": [
            "step 1: Heat oven to 180C/160C fan/gas 4. Line a roasting tin about the size of A4 paper with enough baking parchment to cover the base and sides. Fry the sausages and bacon in a non-stick pan until golden, stirring them often to stop them sticking. Scoop into the tin.",
            "step 2: Place the pan back on the heat and fry the mushrooms for about 5 mins until golden, then add these to the tray, too. Whisk the egg whites with the milk and lots of seasoning. Pour into the tin, then dot the tomatoes on top.",
            "step 3: Bake in the oven for 20-25 mins, until set. Meanwhile, tip the beans into a pan with the paprika and heat through. Scatter the frittata with the chives and serve with the beans on the side."
        ],
        "nutrition_data": {
            "kcal": "268low",
            "fat": "6glow",
            "saturates": "2g",
            "carbs": "27g",
            "sugars": "7g",
            "fibre": "9g",
            "protein": "26g",
            "salt": "3.3g"
        }
    },
    {
        "recipe_name": "Eggs benedict with smoked salmon & chives",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-857455_11-4f5a8dd.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "4eggs",
            "2 tbspwhite wine vinegar",
            "2English muffinshalved",
            "a littlebutterfor spreading",
            "8 slicessmoked salmon",
            "choppedchivesto serve"
        ],
        "recipe_steps": [
            "step 1: First make the hollandaise sauce. Put the lemon juice and vinegar in a small bowl, add the egg yolks and whisk with a balloon whisk until light and frothy. Place the bowl over a pan of simmering water and whisk until mixture thickens. Gradually add the butter, whisking constantly until thick – if it looks like it might be splitting, then whisk off the heat for a few mins. Season and keep warm.",
            "step 2: To poach the eggs, bring a large pan of water to the boil and add the vinegar. Lower the heat so that the water is simmering gently. Stir the water so you have a slight whirlpool, then slide in the eggs one by one. Cook each for about 4 mins, then remove with a slotted spoon.",
            "step 3: Lightly toast and butter the muffins, then put a couple of slices of salmon on each half. Top each with an egg, spoon over some hollandaise and garnish with chopped chives."
        ],
        "nutrition_data": {
            "kcal": "564",
            "fat": "44g",
            "saturates": "23g",
            "carbs": "16g",
            "sugars": "1g",
            "fibre": "1g",
            "protein": "27g",
            "salt": "3.1g"
        }
    },
    {
        "recipe_name": "Banana overnight oats",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/01/Banana-Overnight-Oats-16f2208.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "2bananaspeeled",
            "100gporridge oats",
            "¼ tspground cinnamonplus a pinch to serve",
            "1 tbspmaple syrup",
            "300mlmilk of your choiceplus a splash",
            "2 tbsppeanut or almond butterplus extra to serve",
            "2 tbsp flaked or choppedalmonds",
            "2-4 tbspnatural yogurtto serve (optional)"
        ],
        "recipe_steps": [
            "step 1: Mash 1 banana in a bowl with a fork until smooth. Stir in the oats, cinnamon, maple syrup, milk and peanut butter. Mix well, then cover and chill overnight.",
            "step 2: The next morning, stir the porridge, adding another splash of milk if the mixture is quite stiff. Divide between two bowls. Slice the remaining banana and scatter this over the porridge, drizzle with more nut butter and sprinkle over the almonds. Top with spoonfuls of yogurt, if using, and sprinkle with a pinch more cinnamon before serving."
        ],
        "nutrition_data": {
            "kcal": "557",
            "fat": "23g",
            "saturates": "5g",
            "carbs": "65g",
            "sugars": "28g",
            "fibre": "6ghigh",
            "protein": "20g",
            "salt": "0.3glow"
        }
    },
    {
        "recipe_name": "Pancakes for one",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/pancakes-for-one-597b7c1.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "1large  egg",
            "40gplain flour",
            "½ tspbaking powder",
            "45mlmilk(dairy, nut or oat based)",
            "1 tspbutter",
            "½ tbspoil",
            "maple syrupor honey and berries, to serve (optional)"
        ],
        "recipe_steps": [
            "step 1: Separate the egg, putting the white and yolk in separate bowls. Mix the egg yolk with the flour, baking powder and milk to make a smooth paste.",
            "step 2: Beat the egg white and a pinch of salt with an electric whisk (or by hand) until fluffy and holding its shape. Gently fold the egg white into the yolk mixture. Be extra careful not to knock any of the air out.",
            "step 3: Heat the butter and oil in a non-stick frying pan. Dollop a third of the mixture into the pan and cook on each side for 1-2 mins or until golden brown. Repeat with the remaining mixture to make three pancakes. Drizzle over some maple syrup or honey and serve with berries, if you like."
        ],
        "nutrition_data": {}
    },
    {
        "recipe_name": "Full English traybake",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/pancakes-for-one-597b7c1.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "a little  butterfor the dish",
            "18chipolatas(or thick cut bacon)",
            "250glarge cherry tomatoessome halved, others left whole",
            "1 tbspwholegrain mustard",
            "1 tbsphoney",
            "12slices French bread",
            "6eggs",
            "a few chivessnipped"
        ],
        "recipe_steps": [
            "step 1: Heat oven to 200C/180C fan/gas 6. Butter 1 very large baking tray or 2 small ones. Put the sausages and tomatoes in the tray. Cook for 15 mins, then remove from the oven.",
            "step 2: Mix the mustard and honey together and drizzle over the sausages. Add the bread slices to the tray and crack the eggs in between the other ingredients. Put back in the oven for 6 mins more or until the eggs are just set. Serve with chives sprinkled on top."
        ],
        "nutrition_data": {
            "kcal": "454",
            "fat": "28g",
            "saturates": "9g",
            "carbs": "33g",
            "sugars": "7g",
            "fibre": "2g",
            "protein": "21g",
            "salt": "2.35g"
        }
    },
    {
        "recipe_name": "Dippy eggs with Marmite soldiers",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/pancakes-for-one-597b7c1.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "2eggs",
            "4slices wholemeal bread",
            "a knob of butter",
            "Marmite",
            "mixed seeds"
        ],
        "recipe_steps": [
            "step 1: Bring a pan of water to a simmer. Add 2 eggs, simmer for 2 mins if room temp, 3 mins if fridge-cold, then turn off heat. Cover the pan and leave for 2 mins more.",
            "step 2: Meanwhile, toast 4 slices wholemeal bread and spread thinly with butter, then Marmite. To serve, cut into soldiers and dip into the egg, then a few mixed seeds."
        ],
        "nutrition_data": {
            "kcal": "372",
            "fat": "21g",
            "saturates": "8g",
            "carbs": "31g",
            "sugars": "2g",
            "fibre": "4g",
            "protein": "17g",
            "salt": "1.09glow"
        }
    },
    {
        "recipe_name": "Cheesy French toast with ham & grilled vine tomatoes",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-73536_11-7e4c448.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "5eggsbeaten",
            "4 tbspmilk",
            "140ggruyèregrated",
            "1 tbspchopped chives",
            "knob of butter",
            "1largebaguettethickly sliced",
            "250gcherry tomatoeson the vine",
            "olive oilfor grilling",
            "250gsliced ham- about 25 slices (James used Serrano)",
            "watercressto serve"
        ],
        "recipe_steps": [
            "step 1: Heat the grill to high. In a shallow bowl, whisk together the eggs, milk, cheese and chives. Melt the butter in a large non-stick pan over a medium heat. Dip slices of bread into the egg mixture, then place them in the pan. Cook for 3-5 mins on each side, or until golden and crisp, then keep warm in a low oven if you need to.",
            "step 2: Place the vine tomatoes on a baking tray, drizzle with a little oil and season with salt and pepper. Grill until they start to soften and blister. On a large platter, pile up the cheesy French bread, grilled tomatoes, sliced ham and a pile of watercress, and let everyone dig in."
        ],
        "nutrition_data": {
            "kcal": "439",
            "fat": "25g",
            "saturates": "10g",
            "carbs": "26g",
            "sugars": "3g",
            "fibre": "2g",
            "protein": "29g",
            "salt": "3.7g"
        }
    },
    {
        "recipe_name": "Mushroom hash with poached eggs",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/440-400-mushroom-hash-with-poached-eggs-7527ce8.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "1 ½ tbspavocado oil",
            "2large onionshalved and sliced",
            "500gclosed cup mushroomsquartered",
            "1 tbspfresh thyme leavesplus extra for sprinkling",
            "500gfresh tomatoeschopped",
            "1 tspsmoked paprika",
            "4 tspomega seed mix(see tip)",
            "4large eggs"
        ],
        "recipe_steps": [
            "step 1: Heat the oil in a large non-stick frying pan and fry the onions for a few mins. Cover the pan and leave the onions to cook in their own steam for 5 mins more.",
            "step 2: Tip in the mushrooms with the thyme and cook, stirring frequently, for 5 mins until softened. Add the tomatoes and paprika, cover the pan and cook for 5 mins until pulpy. Stir through the seed mix.",
            "step 3: If you're making this recipe as part of our two-person Summer Healthy Diet Plan, poach two of the eggs in lightly simmering water to your liking. Serve on top of half the hash with a sprinkling of fresh thyme and some black pepper. Chill the remaining hash to warm in a pan and eat with freshly poached eggs on another day. If you're serving four people, poach all four eggs, divide the hash between four plates, sprinkle with thyme and black pepper and serve with the eggs on top."
        ],
        "nutrition_data": {
            "kcal": "283",
            "fat": "17g",
            "saturates": "5g",
            "carbs": "15g",
            "sugars": "11g",
            "fibre": "6g",
            "protein": "15g",
            "salt": "0.2g"
        }
    },
    {
        "recipe_name": "Green spirulina smoothie",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/04/Spirulina-smoothie-40fc97e.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "½ smallavocadopeeled and stoned",
            "1 tspspirulina powder",
            "50gbaby spinach",
            "¼cucumberroughly chopped",
            "1limezested and juiced",
            "10gmintplus a sprig to garnish (optional)",
            "75mlapple juice(not from concentrate), chilled",
            "1 tsphoney(optional)"
        ],
        "recipe_steps": [
            "step 1: Tip all the ingredients into a blender or food processor with 75ml cold water, and blitz until smooth. Or, put everything in a bowl and blitz with a hand blender.",
            "step 2: Pour into a tall glass and garnish with a mint sprig, if you like. Drink straightaway."
        ],
        "nutrition_data": {
            "kcal": "176",
            "fat": "11g",
            "saturates": "2g",
            "carbs": "11g",
            "sugars": "8g",
            "fibre": "3g",
            "protein": "7g",
            "salt": "0.2g"
        }
    },
    {
        "recipe_name": "Easy protein pancakes",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/04/Spirulina-smoothie-40fc97e.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "1banana",
            "75goats",
            "3 largeeggs",
            "2 tbspmilk(dairy, soya, oat or nut milks all work)",
            "1 tbspbaking powder",
            "pinch ofcinnamon",
            "2 tbspprotein powder(whey, pea or whatever your preference)",
            "coconut oilor a flavourless oil, for frying",
            "nut buttermaple syrup and berries or sliced banana to serve"
        ],
        "recipe_steps": [
            "step 1: Whizz the banana, oats, eggs, milk, baking powder, cinnamon and protein powder in a blender for 1-2 mins until smooth. Check the oats have broken down, if not, blend for another minute.",
            "step 2: Heat a drizzle of oil in a pan. Pour or ladle in 2-3 rounds of batter, leaving a little space between each to spread. Cook for 1-2 minutes, until bubbles start to appear on the surface and the underside is golden. Flip over and cook for another minute until cooked through. Transfer to a warmed oven and repeat with the remaining batter. Serve in stacks with nut butter, maple syrup and fruit."
        ],
        "nutrition_data": {
            "kcal": "437",
            "fat": "16g",
            "saturates": "4g",
            "carbs": "39g",
            "sugars": "9glow",
            "fibre": "4g",
            "protein": "31ghigh",
            "salt": "1.4g"
        }
    },
    {
        "recipe_name": "Orange & dark chocolate yogurt bowls",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/04/Spirulina-smoothie-40fc97e.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "80gporridge oats",
            "640mlsoya milk",
            "2 x 120g potsbio yogurtor soya yogurt",
            "2orangespeeled and chopped",
            "16gpecansor walnuts, chopped",
            "10gdark chocolate",
            "cinnamon"
        ],
        "recipe_steps": [
            "step 1: Tip the oats into a pan and pour in the soya milk. Stir over a medium heat for 5-8 mins until the oats are cooked and the mixture thickens slightly. Pour into two bowls and allow to cool for a few minutes to thicken further.",
            "step 2: Smooth the yogurt over the top to completely cover the porridge, then top with the oranges, nuts, chocolate and cinnamon."
        ],
        "nutrition_data": {
            "kcal": "440",
            "fat": "19g",
            "saturates": "4g",
            "carbs": "42g",
            "sugars": "14g",
            "fibre": "9ghigh",
            "protein": "20g",
            "salt": "0.3g"
        }
    },
    {
        "recipe_name": "Baked eggs with spinach, tomatoes, ricotta & basil",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/04/Spirulina-smoothie-40fc97e.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "1 tbspolive oil",
            "1onionfinely chopped",
            "1garlic clovecrushed",
            "pinch ofchilli flakes",
            "3 x 400g cans finelychopped tomatoes(or blitz regular canned chopped tomatoes using a food processor or hand blender)",
            "3 tbspsundried tomato pesto(ensure vegetarian, if needed)",
            "200gspinachroughly chopped",
            "8large eggs",
            "100gricotta",
            "40gparmesanor vegetarian alternative, finely grated",
            "handful ofbasil leaves",
            "crusty breador focaccia, to serve"
        ],
        "recipe_steps": [
            "step 1: Heat the oil and 2 tbsp butter in a large, shallow, flameproof casserole or frying pan over a low-medium heat and fry the onion with a pinch of salt for 10 mins until soft and translucent. Add the garlic and chilli flakes, and fry for 1 min more. Tip in the tomatoes, 1 tsp sugar and pesto. Season and simmer, uncovered, for 10 mins, stirring often. Tip in the spinach and cook for another 5 mins until wilted.",
            "step 2: Heat the grill to high. Make eight gaps in the sauce with the back of a spoon and crack an egg into each. Dot over the ricotta and scatter with the parmesan. Cover and cook for 5 mins, then slide under the hot grill for a few minutes until the egg whites are set and the yolks runny. Scatter with the basil and serve with crusty bread for dunking."
        ],
        "nutrition_data": {
            "kcal": "271low",
            "fat": "17g",
            "saturates": "5g",
            "carbs": "11g",
            "sugars": "11g",
            "fibre": "3g",
            "protein": "17g",
            "salt": "0.7g"
        }
    },
    {
        "recipe_name": "Breakfast pancake platter",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/02/pancake-platter-78dc92d.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "100gwholemeal plain spelt flour",
            "2eggswhites and yolks separated",
            "150mlsemi-skimmed milk",
            "drop ofoilfor cooking (optional)"
        ],
        "recipe_steps": [
            "step 1: Tip the flour into a bowl, then whisk in the egg yolks and half the milk until smooth. Slowly whisk in the rest of the milk (the batter will be runny). Whisk the egg whites to soft peaks in a separate bowl, then gently fold this into the batter.",
            "step 2: Heat a large non-stick pan over a medium heat and wipe a drop of oil around the base using a kitchen towel. Spoon in 2 tbsp of batter per pancake (you should be able to make three at a time, well- spaced apart) and cook for 2-3 mins until bubbles appear on the surface and the bottom is set. Flip using a palette knife and cook for 2-3 mins more. Arrange the pancakes in a single layer over a large serving platter, then top one side with the salmon, soft cheese, cucumber slices, lemon wedges and onion slices. Top the other side with the yogurt, banana slices and berries. If you like, scatter the savoury pancakes with the capers, dill and spring onions, if using, and top the sweet pancakes with walnuts, seeds, cinnamon and maple syrup. Or, serve these on the side for everyone to help themselves."
        ],
        "nutrition_data": {
            "kcal": "371",
            "fat": "16g",
            "saturates": "5g",
            "carbs": "32g",
            "sugars": "16g",
            "fibre": "6ghigh",
            "protein": "22g",
            "salt": "0.5g"
        }
    },
    {
        "recipe_name": "Ginger & vanilla pears porridge topper",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/02/pancake-platter-78dc92d.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "1vanilla bean podhalved",
            "20ggingerpeeled and grated",
            "1cinnamon stick",
            "150gcaster sugar",
            "1lemonjuiced",
            "4pearspeeled, halved and cored"
        ],
        "recipe_steps": [
            "step 1: Scrape the seeds from the vanilla pod into a wide saucepan. Drop in the pod as well, then add the ginger, cinnamon stick, sugar, lemon juice and 500ml water. Bring to a simmer over a medium-high heat and bubble for 5 mins until starting to reduce. Add the pears and stir to coat. Reduce the heat to medium-low and simmer for 15-20 mins more until the pears are tender when pierced with a knife. Once cool, the pears in their poaching liquid will keep chilled in an airtight container for up to five days.",
            "step 2: Meanwhile, make the porridge. Tip the oats, milk and 800ml water into a saucepan along with a pinch of salt. Cook, stirring often, over a medium heat for 8-10 mins until thickened and creamy – cook for slightly longer if you prefer a thicker porridge, or add a splash of water if you prefer it thinner. The more you stir, the creamier it will become.",
            "step 3: Serve the porridge in bowls topped with the pear halves and a drizzle of the poaching syrup."
        ],
        "nutrition_data": {
            "kcal": "494",
            "fat": "8g",
            "saturates": "3g",
            "carbs": "92g",
            "sugars": "58g",
            "fibre": "8ghigh",
            "protein": "10g",
            "salt": "0.2g"
        }
    },
    {
        "recipe_name": "Puff pastry cinnamon rolls",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2022/01/puff-pastry-cinnamon-rolls-d57fcf8.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "1½ tbspground cinnamon",
            "3 tbspcaster sugar",
            "320g ready-rolledpuff pastry",
            "plain flourfor dusting",
            "1 mediumeggbeaten",
            "50gicing sugar"
        ],
        "recipe_steps": [
            "step 1: Heat the oven to 200C/180C fan/gas 6 and line large baking tray with baking parchment. Stir the cinnamon and sugar together in a small bowl. Unravel the puff pastry on a lightly floured work surface, then sprinkle the cinnamon sugar mixture all over the top. Gently level the cinnamon sugar mixture with the back of a spoon so it covers the pastry almost completely, leaving a 1cm border on one of the short sides. Brush a little of the beaten egg over the exposed pastry border.",
            "step 2: Roll the pastry up in a tight log from the short side without the border. Gently press along the egg-washed border to seal, then slice into 12 equal rounds. Arrange the cinnamon rolls on the prepared baking tray, placing them up against each other so they're just touching. Brush the remaining beaten egg all over the tops and sides of the pastry, then bake for 15-18 mins until golden and risen. Leave to cool on the tray for 10-15 mins.",
            "step 3: Combine the icing sugar with 1½ tsp water in a small bowl until you have a thick icing that easily runs off the spoon. Drizzle this over the warm rolls, then immediately serve."
        ],
        "nutrition_data": {}
    },
    {
        "recipe_name": "Salsa verde baked eggs",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2021/08/Salsa-verde-baked-eggs-80334f1.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "5 tbspolive oil",
            "1 tspsmoked paprika",
            "1 tspcumin seeds",
            "400g cancherry tomatoes",
            "200g freshcherry tomatoes",
            "2garlic cloves",
            "1 small bunch ofparsley",
            "1 small bunch ofbasil",
            "½ small bunch ofmintleaves picked",
            "2 tbspcapers",
            "1 tspDijon mustard",
            "2 tbspwhite wine vinegar",
            "200gbaby spinachwashed",
            "4eggs",
            "½ tspchilli flakes(optional)",
            "flatbreadsto serve (optional)"
        ],
        "recipe_steps": [
            "step 1: Drizzle 1 tbsp of the olive oil in a frying pan or skillet, and fry the paprika and cumin for 30 seconds over a medium heat. Add the canned tomatoes and fresh tomatoes, bring to the boil, then simmer with a lid on over a medium heat for 5-6 mins until the tomatoes have softened.",
            "step 2: Meanwhile, put the garlic, most of the parsley, the basil, mint, capers, mustard, white wine vinegar, 4 tbsp oil and 3 tbsp cold water in a mini food processor and blitz to a smooth paste. Season.",
            "step 3: Stir the spinach into the pan with the tomatoes until wilted (put the lid back on for a few minutes, then stir again to help it wilt). Make four dips in the mixture and gently crack an egg into each one. Cover with a lid and cook over a medium heat for 6-8 mins, or until the eggs are just set. Uncover the pan, then drizzle over the herby sauce. Scatter over the reserved parsley and chilli flakes, if using. Serve with flatbreads, if you like."
        ],
        "nutrition_data": {
            "kcal": "268low",
            "fat": "21g",
            "saturates": "4g",
            "carbs": "7g",
            "sugars": "6g",
            "fibre": "3g",
            "protein": "12g",
            "salt": "0.7g"
        }
    },
    {
        "recipe_name": "Vanilla & cinnamon breakfast rice",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2021/03/Vanilla-and-cinnamon-breakfast-rice-a4f3268.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "200gwholemeal basmati rice",
            "200mlwhole milk",
            "2 tspvanilla extract",
            "3bay leaves",
            "1cinnamon stick",
            "12dried apricotssplit in half widthways (so they still look whole)",
            "4 x 100ml pots bioyogurt",
            "12walnuthalves, broken into pieces"
        ],
        "recipe_steps": [
            "step 1: Tip the rice into a large, deep non-stick pan with 600ml water, the milk, vanilla, bay leaves and cinnamon stick. Bring to the boil, then cover with a lid and simmer for 25-30 mins until the rice is tender. Keep an eye on it to ensure it doesn’t boil dry towards the end of its cooking time.",
            "step 2: Meanwhile, tip the apricots into a small pan with 300ml water and cook over a low-medium heat until tender, about 10-15 mins. Set aside.",
            "step 3: Remove the bay leaves and cinnamon stick from the rice, then stir in half the yogurt. Both the rice and the apricots will keep chilled, separately, for up to 24 hrs. Spoon the rice into bowls and top with the remaining yogurt, the apricots and their juices and the walnuts. If you’ve prepared the rice and apricots the day before, eat cold or reheat until warm, adding a splash of milk to the rice to loosen."
        ],
        "nutrition_data": {
            "kcal": "378",
            "fat": "11glow",
            "saturates": "4g",
            "carbs": "54g",
            "sugars": "18g",
            "fibre": "4g",
            "protein": "14g",
            "salt": "0.3g"
        }
    },
    {
        "recipe_name": "Potato scones with smoked salmon & soured cream",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2021/02/Potato-scone-532e2ad.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "1 largeMaris Piper potato(about 225g), quartered",
            "2 tbspunsalted butterplus extra for frying",
            "60gplain flourplus extra for dusting",
            "½ tspbaking powder",
            "vegetable oilfor frying",
            "100gsmoked salmonor trout",
            "60gsoured cream",
            "1 tbsp finely choppedchives"
        ],
        "recipe_steps": [
            "step 1: Bring a small pan of water to the boil and simmer the potatoes for 12-15 mins until tender. Drain and leave to steam-dry. Return the potatoes to the pan and mash with the butter. Stir in the flour, baking powder, ½ tsp salt and a good grinding of black pepper.",
            "step 2: Tip the potato mixture onto a lightly floured work surface and press into a circle roughly 15cm wide and about 1cm thick, then cut into four wedges.",
            "step 3: Heat a splash of oil and a knob of butter in a non-stick skillet or frying pan over a medium heat, and fry one of the scones for 3-4 mins on each side until golden brown. Repeat with the remaining scones.",
            "step 4: Divide the scones and smoked salmon or trout between two plates, then top with the soured cream and chopped chives. Season and serve."
        ],
        "nutrition_data": {
            "kcal": "489",
            "fat": "27g",
            "saturates": "14g",
            "carbs": "42g",
            "sugars": "3g",
            "fibre": "3g",
            "protein": "19g",
            "salt": "2.6g"
        }
    },
    {
        "recipe_name": "Malt loaf",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2011/08/sticky-malt-loaves-b2caec8.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "sunflower oilfor greasing",
            "150mlhot black tea",
            "175gmalt extractplus extra for glazing (see tip)",
            "85gdark muscovado sugar",
            "300gmixed dried fruit",
            "2large eggsbeaten",
            "250gplain flour",
            "1 tspbaking powder",
            "½ tspbicarbonate of soda"
        ],
        "recipe_steps": [
            "step 1: Heat oven to 150C/130C fan/gas 2. Line the base and ends of two greased 450g/1lb non-stick loaf tins with strips of baking parchment.",
            "step 2: Pour the hot tea into a mixing bowl with the malt, sugar and dried fruit. Stir well, then add the eggs.",
            "step 3: Tip in the flour, then quickly stir in the baking powder and bicarbonate of soda and pour into the prepared tins. Bake for 50 mins until firm and well risen. While still warm, brush with a little more malt to glaze and leave to cool.",
            "step 4: Remove from the tins. If you can bear not to eat it straight away, it gets more sticky after wrapping and keeping for 2-5 days. Serve sliced and buttered, if you like."
        ],
        "nutrition_data": {
            "kcal": "140",
            "fat": "1glow",
            "saturates": "0g",
            "carbs": "31g",
            "sugars": "22g",
            "fibre": "1g",
            "protein": "3g",
            "salt": "0.17glow"
        }
    },
    {
        "recipe_name": "Chorizo & halloumi breakfast baguette",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/chorizo-and-halloumi-baguette-addaf63.jpg?quality=90&resize=440,400",
        "recipe_ingredients": [
            "1large avocado",
            "1limejuiced",
            "1red onionhalved and thinly sliced",
            "drizzle ofoil",
            "150gchorizosliced on an angle",
            "250gblock halloumisliced into 8 pieces",
            "1large baguetteor 2 smaller ones",
            "small bunchcorianderleaves picked"
        ],
        "recipe_steps": [
            "step 1: To make the tomato jam, put all the ingredients in a pan, season and simmer for 30 mins until you have a rich, thick glossy jam. Cool, then transfer to a sterilised jar (if you want to keep for over two weeks). Will keep, unopened, for six months.",
            "step 2: Halve the avocado and scoop into a bowl. Add half the lime juice and some salt and mash with a fork. Put the onion in a small bowl, pour over the rest of the lime juice and season with a pinch of salt. Mix well and set aside to lightly pickle.",
            "step 3: Heat a drizzle of oil in a large frying pan or heat an air-fryer to 200C for 4 mins. If you're using the hob, place the chorizo slices on one side of the pan and the halloumi on the other side, turning once the halloumi is golden and the chorizo is sizzling. Cook for about 4-5 mins in total. If you're using the air-fryer, arrange the chorizo slices and halloumi in one layer on opposite sides of the basket. If there isn't enough space, cook them separately in batches. Air-fry for 8-10 mins until the halloumi is golden and the chorizo is browned at the edges.",
            "step 4: Split the baguette and warm it in the air-fryer or oven for 1-2 mins. Spread the avocado over one side of the baguette and the tomato jam over the other. Fill the baguette with the halloumi, chorizo, coriander, and pickled red onions. Cut and serve."
        ],
        "nutrition_data": {
            "kcal": "872",
            "fat": "39g",
            "saturates": "17g",
            "carbs": "91g",
            "sugars": "38g",
            "fibre": "7g",
            "protein": "36g",
            "salt": "4.2g"
        }
    },
    {
        "recipe_name": "The breakfast club",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/04/BreakfastClubSandwich-2f85617.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "3 tbspsunflower oil",
            "4frozen hash browns",
            "3pork sausages",
            "4 rasherssmoked back bacon",
            "15gbutterplus extra for spreading",
            "100gchestnut mushroomssliced",
            "2eggs",
            "400g canbaked beans",
            "6 sliceswhite bread",
            "butterketchup and brown sauce, to serve"
        ],
        "recipe_steps": [
            "step 1: Heat the oven to 220C/200C fan/gas 7. Rub 1 tbsp of the oil over a large, shallow roasting tin. Put the hash browns on one half of the tin and line the sausages up on the other. Cook for 15 mins, then flip the hash browns, turn the sausages and return to the oven for 10-15 mins until the hash browns are golden, and the sausages browned. Push everything together to make room in the tin, then lay the bacon rashers in the space and return to the oven for 10-15 mins or until the bacon fat is crisp and sizzling.",
            "step 2: About 10 mins before the bacon is ready, heat 1 tbsp of oil with the butter in a frying pan until sizzling. Scatter in the mushrooms and season with salt and pepper. Fry over a high heat, tossing occasionally until softened and any liquid released has evaporated (about 5-10 mins), then tip onto a warm plate. Wipe out the pan, heat the rest of the oil and fry the eggs however you like them. While everything is cooking heat the baked beans in a saucepan or in the microwave and lightly toast the bread, then spread the toast with butter.",
            "step 3: To assemble, split the sausages in half and lay three halves on each of two slices of toast. Top the sausages with the bacon then spoon over the mushrooms and top with a second slice of toast. Spread over ketchup or brown sauce (or both), then squash the hash browns down a little and top each toast with two hash browns. Top the hash browns with an egg each, then top with the last slices of toast (spread with more sauce, if you like). Press down lightly on each sandwich and serve as they are or cut in half to get a runny yolk oozing out of each sandwich. Serve with a bowl of baked beans on the side."
        ],
        "nutrition_data": {
            "kcal": "991",
            "fat": "51g",
            "saturates": "16g",
            "carbs": "85g",
            "sugars": "13g",
            "fibre": "16ghigh",
            "protein": "41g",
            "salt": "4.74g"
        }
    },
    {
        "recipe_name": "Basic omelette recipe",
        "recipe_image_link": "https://images.immediate.co.uk/production/volatile/sites/30/2024/04/BreakfastClubSandwich-2f85617.jpg?quality=90&resize=556,505",
        "recipe_ingredients": [
            "3eggsbeaten",
            "1 tspsunflower oil",
            "1 tspbutter"
        ],
        "recipe_steps": [
            "step 1: Season the beaten eggs well with salt and pepper. Heat the oil and butter in a non-stick frying pan over a medium-low heat until the butter has melted and is foaming.",
            "step 2: Pour the eggs into the pan, tilt the pan ever so slightly from one side to another to allow the eggs to swirl and cover the surface of the pan completely. Let the mixture cook for about 20 seconds then scrape a line through the middle with a spatula.",
            "step 3: Tilt the pan again to allow it to fill back up with the runny egg. Repeat once or twice more until the egg has just set.",
            "step 4: At this point you can fill the omelette with whatever you like – some grated cheese, sliced ham, fresh herbs, sautéed mushrooms or smoked salmon all work well. Scatter the filling over the top of the omelette and fold gently in half with the spatula. Slide onto a plate to serve."
        ],
        "nutrition_data": {
            "kcal": "277",
            "fat": "22g",
            "saturates": "7g",
            "carbs": "0g",
            "sugars": "0glow",
            "fibre": "0g",
            "protein": "20g",
            "salt": "0.8g"
        }
    },
    {
        "recipe_name": "Overnight oats",
        "recipe_image_link": "https://media.delight.video/0c18e53b610964fac175fe0e757adc30557e79b7/ecbac1863e9705426caec558fbf3d41aa94b2933/POSTER_USER/v2/4d73bd3b-f0fb-435a-a6ac-16d330ad382d.png?quality=90",
        "recipe_ingredients": [
            "¼ tspground cinnamon",
            "50grolled porridge oats",
            "2 tbspnatural yogurt",
            "50gmixed berries",
            "drizzle ofhoney",
            "½ tbspnut butter(we used almond)"
        ],
        "recipe_steps": [
            "step 1: The night before serving, stir the cinnamon and 100ml water (or milk) into your oats with a pinch of salt.",
            "step 2: The next day, loosen with a little more water (or milk) if needed. Top with the yogurt, berries, a drizzle of honey and the nut butter."
        ],
        "nutrition_data": {
            "kcal": "348",
            "fat": "11g",
            "saturates": "2g",
            "carbs": "46.07g",
            "sugars": "13g",
            "fibre": "6g",
            "protein": "13g",
            "salt": "0.17glow"
        }
    }
]